{"pages":[{"title":"eXist-db und VueJS für dynamische UI-Komponenten","text":"DHD Workshop 2019 DHD Workshop 2019","tags":"","url":"index.html"},{"title":"Bevor es losgeht","text":"Bevor es losgeht Ein kleiner Hinweis Voraussetzungen Bevor es losgeht Ein kleiner Hinweis Diese Dokumentation dient als Orientierung für den Workshop eXist-db und VueJS für dynamische UI-Komponenten auf der DHd-Konferenz 2019 in Mainz\/Frankfurt am Main. Während des Workshops stellen wir die nötige Infrastruktur zum Mitmachen bereit. Danach können die Inhalte weiterhin nachvollzogen werden, indem man sich die nötigen Tools selbst auf dem eigenen Rechner installiert. Bis 05.04. - Infrastruktur nachnutzen Ab 05.04. - Tools selbst installieren Dieser Leitfaden ist darauf ausgerichtet, dass die Inhalte selbst vollzogen werden können. Voraussetzungen Folgende Kenntnisse werden vorausgesetzt: Grundlegende Kenntnisse in HTML, XML und JavaScript Folgende Software sollte installiert sein: Ein moderner Browser, z.B. Mozilla Firefox oder Google Chrome (nicht Internet Explorer!) Ein Code-Editor, z.B. Visual Studio Code, Atom oder Notepad++ Eine Java-Installation (siehe Systemvoraussetzungen) eXist-db (Einrichtungsanleitung) quoteSalute App in der eXist-db (Einrichtungsanleitung)","tags":"","url":"Vorab\/Bevor_es_losgeht.html"},{"title":"quoteSalute","text":"quoteSalute Links Literatur quoteSalute In den Digital Humanities werden in den letzten Jahren immer mehr digitale Briefeditionen erstellt, von denen viele bereits ihre Daten als TEI-XML offen und kostenlos bereitstellen. Das Projekt quoteSalute erprobt das kreative Potential dieser offenen Forschungsdaten, indem es Grußformeln der Brieftexte aus verschiedenen Editionen aggregiert und über eine Webseite bereitstellt, von wo aus sie per Knopfdruck in die eigene E-Mail-Korrespondenz kopiert werden können. Nutzer*innen können so Briefabschlüsse historisch interessanter Persönlichkeiten zitieren und diese für ihre eigene alltägliche Korrespondenz verwenden. quoteSalute entstand als studentisches Projekt der TELOTA-Initiative im März 2018 an der Berlin-Brandenburgische Akademie der Wissenschaften mit dem Ziel, die editorische Arbeit digitaler Editionen über den wissenschaftlichen Diskurs hinaus auf kreative Weise auszuschöpfen und ihr dadurch mehr öffentliche Präsenz zu verschaffen. Durch die Nachnutzung der Forschungsdaten in quoteSalute werden die historischen Grußformeln spielerisch in den Alltagskontext des E-Mail-Schreibens integrierbar, wobei trotz Neu-Kontextualisierung der Grußformeln die Verbindung zur “Ursprungsedition” durch eine Verlinkung bestehen bleibt, sodass sich bei einer breiteren Verwendung der Applikation die digitalen Editionen einer größeren Bekanntheit erfreuen dürfen. quoteSalute wurde im September 2018 mit dem DARIAH-DE DH-Award ausgezeichnet, das SWR 2 “Journal am Mittag” berichtet außerdem in einem Feature über das Projekt. Das Generieren der Grußformeln als Webapplikation wurde mit HTML, CSS (Bootstrap) und dem Javascript Front-End-Framework VueJS realisiert. Die Daten werden in eXist-db vorgehalten, die Datenbankabfrage erfolgt mittels XQuery und die Response-Daten werden im JSON-Format ausgegeben. quoteSalute ist über die Webseite des DfG-Projekts “correspSearch - Briefeditionen vernetzen” (Dumont 2016) verfügbar. Daten, Code und Dokumentation stehen über ein GitHub-Repositorium unter freien Lizenzen bereit. Interessierte Editionsvorhaben sind dazu eingeladen, selbst Datensätze beizusteuern. Links Projektwebseite: quoteSalute.net Github: https:\/\/github.com\/telota\/quoteSalute Blogbeitrag zum DARIAH-Award: https:\/\/dhd-blog.org\/?p=10534 Bericht beim SWR 2: https:\/\/www.ardmediathek.de\/tv\/SWR2-Journal-am-Mittag\/Die-Website-quoteSalute\/SWR2\/Audio?bcastId=8757898&amp;documentId=53957190 [letzter Zugriff am 04.10.2018] Literatur Dumont, Stefan: “correspSearch – Connecting Scholarly Editions of Letters”. In: Journal of Text Encoding Initiative. Issue 10. 2016.","tags":"","url":"Vorab\/quoteSalute.html"},{"title":"Das quoteSalute XML Korpus","text":"Das quoteSalute XML Korpus Literatur Das quoteSalute XML Korpus Als „Indikator für die Beziehungen, die der Briefschreiber zu dem -empfänger hat oder zu haben glaubt“ (Ermert 1979: 104) sind und waren Grußformeln wesentliche Elemente der schriftlichen Kommunikation, insbesondere des Briefes. Deshalb bieten die Richtlinien der Text Encoding Initiative (TEI) mit dem Element &lt;salute&gt; auch seit langem eine entsprechende Kodierungsmöglichkeit (TEI-Konsortium 2018). Für quoteSalute werden Grußformeln anhand des &lt;salute&gt;-Elements aus TEI-XML-kodierten Briefeditionen extrahiert und in die TEI-XML basierte Struktur des quoteSalute-Austauschformats konvertiert. Für jede Breifedition, die in das Korpus integriert werden soll, wird eine XML-Datei angelegt. Diese besteht aus einem &lt;teiHeader&gt; mit den Metadaten (zum Beispiel wo die Daten herstammen) und einem &lt;body&gt;, der eine Liste aus &lt;cit&gt;-Elementen enthält. Jedes &lt;cit&gt; enthält dann die Grußformel, sowie Angaben zum ursprünglichen Brief und zur jeweiligen Edition. Eine Tabellen mit detaillierte Informationen über die Struktur der benötigten TEI-XML-Datei, die für eine Einbindung von Grußformeln in quoteSalute erforderlich ist, finden Sie in der Dokumentation auf der Projektwebseite. Hier ein Beispiel einer Grußformel im Korpus: &lt;cit&gt; &lt;quote xml:lang=&quot;deu&quot; ana=&quot;#formal #s-m #r-m&quot;&gt;Leb wohl.&lt;\/quote&gt; &lt;bibl&gt; &lt;title type=&quot;edition&quot;&gt;Briefe und Texte aus dem intellektuellen Berlin um 1800&lt;\/title&gt; &lt;title type=&quot;letter&quot;&gt;Brief von Adelbert von Chamisso an Louis de La Foye (ohne Ort, Ende Oktober 1804)&lt;\/title&gt; &lt;ref target=&quot;http:\/\/www.berliner-intellektuelle.eu\/manuscript?Brief008ChamissoandeLaFoye.xml&quot;\/&gt; &lt;\/bibl&gt; &lt;\/cit&gt; Anschließenden erfolgt eine manuellen Kuratierung. Die Daten werden von Wiederholungen und unpassenden Inhalten bereinigt und mit weiterer semantischer Information angereichert. Letzteres ermöglicht ein späteres Filtern nach: Formalität: Informell bzw. freundschaftlich oder formal Geschlecht der Korrespondierenden wie es grammatikalisch aus der Quelle hervorgeht: neutral, weiblich oder männlich Sprache: bisher sieben verschiedene, darunter Deutsch, Englisch, Italienisch und Latein Jede Grußformel erhält ein @xml:lang mit der entsprechenden Sprache und ein @ana, welches Informationen über Geschlecht und Grad der Formalität enthält. Das folgende Beispiel zeigt, wie das Tagging zur semantischen Anreicherung der Grußformeln umgesetzt wurde: &lt;quote xml:lang=&quot;deu&quot; ana=&quot;#formal #s-n #r-n&quot;&gt;Bis dahin empfiehlt sich Ihrem Wohlwollen hochachtungsvoll&lt;\/quote&gt; Die hier getaggte Grußformel ist in deutscher Sprache, von formellem Charakter und impliziert sowohl für Sender und Empfänger kein erkennbares Geschlecht. Das Korpus von quoteSalute umfasst derzeit 981 Grußformeln aus 14 verschiedenen Briefeditionen (Stand März 2019), unter anderem aus den Editionen “Briefe und Texte aus dem intellektuellen Berlin um 1800” (Balliot o.J.), “Digitale Edition der Briefe Erdmuthe Benignas von Reuß-Ebersdorf (1670-1732)” (Prell\/Schmidt-Funke 2017) und “DER STURM. Digitale Quellenedition zur Geschichte der internationalen Avantgarde” (Trautmann \/ Schrade 2018). Alle Editionen haben ihre Daten unter einer freien Lizenzen zur Verfügung gestellt. Literatur Baillot, Anne (Ed.) (o.J.): Briefe und Texte aus dem intellektuellen Berlin um 1800. Berlin: Humboldt-Universität zu Berlin. www.berliner-intellektuelle.eu\/ [letzter Zugriff am 04.10.2018] Ermert, Karl (1979). Briefsorten. Untersuchungen zu Theorie und Empirie der Textklassifikation. Tübingen: Niemeyer. Prell, Martin \/ Schmidt-Funke, Julia (Eds.) (2017): Digitale Edition der Briefe Erdmuthe Benignas von Reuß-Ebersdorf (1670-1732). Jena [Work in Progress]. http:\/\/erdmuthe.thulb.uni-jena.de [letzter Zugriff am 04.10.2018] TEI Consortium (2018). . TEI P5: Guidelines for Electronic Text Encoding and Interchange. [Version 3.4.0 23rd July 2018]. http:\/\/www.tei-c.org\/release\/doc\/tei-p5-doc\/en\/html\/ref-salute.html [letzter Zugriff am 04.10.2018] Trautmann, Marjam \/ Schrade, Torsten (Eds.) (2018): DER STURM. Digitale Quellenedition zur Geschichte der internationalen Avantgarde. Mainz: Akademie der Wissenschaften und der Literatur. https:\/\/sturm-edition.de\/quellen\/briefe.html [letzter Zugriff am 04.10.2018]","tags":"","url":"Vorab\/Das_quoteSalute_XML_Korpus.html"},{"title":"Softwarearchitektur","text":"Softwarearchitektur Softwarearchitektur","tags":"","url":"Vorab\/Softwarearchitektur.html"},{"title":"eXist-db Installation","text":"eXist-db Installation Systemvoraussetzungen Installation eXist-db starten eXist-db Installation Um an quoteSalute arbeiten zu können, muss zunächst eXist-db und dann die quoteSalute.DB App installiert werden. In diese Anleitung sind alle notwendigen Schritte beschrieben. Systemvoraussetzungen eXist-db läuft mit Java und funktioniert somit auf allen aktuellen Linux, macOS und Windows Betriebsystemen. Folgende Voraussetzungen sind erforderlich: mindestens Java 8 (Installations-Anleitungen finden Sie hier: Java-Downloads für alle Betriebssysteme) ca. 200Mb Festplattenkapazität ca. 512Mb Arbeitsspeicher Für einige Schritte sind administrative Rechte erforderlich. Hinweis: Prüfen Sie vorab, ob Java 8 installiert ist und andere\/ältere Versionen von eXist-db vollständig deinstalliert sind. Installation Gehen Sie auf Homepage von eXist-db und klicken Sie auf &quot;Download eXist-db&quot;. Es wird eine .jar-Datei heruntergeladen mit dem Namen eXist-db-setup-[version].jar (z.B. eXist-db-setup-4.6.1.jar). Gehen Sie in den Downloadordner und führen Sie die .jar-Datei aus: bei Windows und Mac doppelt klicken bei Linux rechtsklick und dann auf &quot;mit Java ausführen&quot; klicken oder über die Kommandozeile: java -jar eXist-db-setup-[version].jar Nun öffnet sich ein Installationsassitent. Wir empfehlen die Standardeinstellungen beizubehalten. Klicken Sie auf &quot;Next&quot;. Sie werden nach folgenden Schritten gefragt: Installationsordner: wählen Sie einen Pfad und klicken Sie auf &quot;Next&quot;. Datenordner wählen Sie einen Pfad und klicken Sie auf &quot;Next&quot;. Admin Passwort und Memory Einstellungen: geben Sie hier ein Passwort Ihrer Wahl ein. Dieses wird später bei bestimmten Aktionen in eXist-db benötigt. Hinweis: das Freilassen stellt ein Sicherheitsrisiko dar und ist deshalb nicht zu empfehlen. Package Installation: Klicken Sie &quot;Next&quot; Nun erfolgt die package installation. Klicken Sie anschließend auf &quot;Next&quot; Nun erfolgen weitere Installationen. Klicken Sie anschließend auf &quot;Next&quot;. Wählen Sie Ihre präferierten Shortcuts und klicken Sie anschließend auf &quot;Next&quot; Bei erfolgreicher Installation wird dieses Fenster angezeigt: eXist-db starten Um eXist-db zu starten, führen Sie die exist.jar in ihrem Installationsordner aus. Es öffnet sich nun ein Fenster: Das eXist-db Icon findet sich nun in Ihrer Symbolleiste. Zum Öffnen des Menüs klicken Sie auf das Icon . Klicken Sie auf &quot;install as a Service&quot; falls dies nicht bereits erfolgt ist.","tags":"","url":"eXist-db_Setup\/eXist-db_Installation.html"},{"title":"quoteSalute Installation","text":"quoteSalute Installation Weitere Informationen quoteSalute Installation Gehen Sie auf das Github-Repository von quoteSalute und speichern Sie die Datei quoteSalute.db-[version].xar lokal ab. Öffnen Sie das eXist-db Menü (klick auf das Icon in der Symbolleiste) und klicken Sie auf &quot;Open Dashboard&quot;. Ihr Standardbrowser (vorzugsweise Firefox oder Chrome) sollte sich nun öffnen und das eXist-db Dashboard anzeigen . Standardmäßig ist die lokal installierte eXist-db-Instanz unter der folgenden URL: http:\/\/localhost:8080 zu erreichen. Geben Sie nun Ihre Admin-Nutzerdaten ein: User: admin Password: [Ihr Passwort, das Sie bei der Installation vergeben haben] Öffnen Sie die Package Manager App. Klicken Sie auf den Button add a package, ziehen Sie die gespeicherte Datei quoteSalute.db-〈version〉.xar in das Fenster Upload Packages oder klicken Sie auf Upload und wählen die xar-Datei über Ihr Dateiexplorer aus und schließen Sie das Fenster Package Manager. Im Dashboard sehen Sie nun die quoteSalute.DB App. Weitere Informationen Java-Downloads für alle Betriebssysteme eXist-db Basic Installation eXist-db Troubleshooting","tags":"","url":"eXist-db_Setup\/quoteSalute_Installation.html"},{"title":"Übersicht","text":"Übersicht Übersicht In diesem Kapitel werden Sie lernen, wie man in eXist-db eXide bedient, den quoteSalute-XML-Korpus mit TEI abfragt, zufällige Grußformeln extrahiert, XML zu JSON transformiert und Datenbankabfragen mit Filtern versieht. Es gibt zwei Challenges, um ihr gelerntes Wissen anzuwenden: Challenge 1: Eine Grußformel abrufen Challenge 2: Ein neuer Filter","tags":"","url":"XML_zu_JSON_in_eXist-db\/Übersicht.html"},{"title":"Erste Schritte mit eXide","text":"Erste Schritte mit eXide Wichtige URLs eXide Starten Aufbau von eXide Erste Schritte mit eXide In diesem Abschnitt wird erklärt, wie man mit der eXist-db internen IDE (Integrated Development Environment; dt. Entwicklungsumgebung) Dateien innerhalb eines eXist-db-Projekts bearbeitet. Wichtige URLs Bei einer lokalen Standardinstallation sollten Sie die folgenden Teilbereiche der Applikation unter folgenden URLs erreichen: eXist-Dashboard - http:\/\/localhost:8080\/exist\/apps\/dashboard\/index.html eXide - http:\/\/localhost:8080\/exist\/apps\/eXide\/index.html quoteSalute - http:\/\/localhost:8080\/exist\/apps\/quoteSalute\/salute.html eXide Starten Gehen Sie auf das eXist-db Dashboard. Klicken Sie auf eXide. Es sollte sich nun ein neuer Browsertab mit eXide öffnen. Aufbau von eXide Dateibrowser (directory) - Hier können Sie die Dateien in der eXist-db browsen und mit Doppelklick öffnen. Toolbar - Die meisten Buttons sind selbsterklärend. a. Eval-Button - Führt ein geöffnetes .xql-Skript aus. b. Run-Button - Startet die geöffnete App. Datei-Tabs - Navigation zwischen den von Ihnen geöffneten Dateien. Editor-Bereich - Hier können Sie den Quellcode der Dateien bearbeiten. Ergebnis-Bereich - Dieser Bereich öffnet sich, nachdem man auf Eval gedrückt hat. Hier werden die Ergebnisse angezeigt.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Erste_Schritte_mit_eXide.html"},{"title":"Den quoteSalute Korpus abfragen","text":"Den quoteSalute Korpus abfragen abfrage.xql - Das quoteSalute-Back-End Einfache Datenbankabfrage Ergebnisse in eXide Ergebnisse im Browser Den quoteSalute Korpus abfragen Die Datenbankabfragen bei quoteSalute werden über die Datei abfrage.xql abgewickelt. In diesem Abschnitt wird eine sehr vereinfachte Version dieser Datei erklärt, um die Funktionsweise Schritt für Schritt zu erläutern. abfrage.xql - Das quoteSalute-Back-End Öffnen Sie eXide über Ihr eXist-Dashboard. Siehe dazu auch: Wichtige URLS Öffnen Sie im Dateibrowser die Datei \/db\/apps\/quotesalute\/abfrage-tutorial-01.xql Einfache Datenbankabfrage Der folgende Code-Schnipsel bezieht sich auf die Datei abfrage-tutorial-01.xql. Innerhalb von eXist-db wird mit der funktionalen Programmiersprache XQuery gearbeitet. Die dazugehörige Dateiendung ist .xql. Im folgenden Code-Beispiel passiert folgendes: xquery version &quot;3.0&quot;; (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; (: Hole alle TEI-Daten aus dem Korpus :) return collection($data)\/\/tei:TEI (: Kommentar :) - Angaben die mit (: beginnen und :) aufhören sind sog. Kommentare. Diese helfen den Code besser zu lesen. Sie haben keinen Einfluss auf den auszuführenden Code. Z. 1: Deklaration der XQuery-Version. Dies hilft der eXist-db den Code zu durchleuchten und den möglichen Funktionsumfang des Codes richtig einzuschätzen. Z. 3: Es wird der TEI-Namensraum deklariert. Namensräume in XML-Daten helfen, den XML-Elementen eine bereits vordefinierte Bedeutung zu verleihen. So wird z.B. mit dem Namensraum-Tag (Element) &lt;tei:lb\/&gt; sichergestellt, dass es sich um einen Zeilenumbruch (Line Break) handelt, und nicht um eine etwaige Nutzung von lb als Gewichtheinheit Pfund. Z. 5: Der Pfad zu der Arbeitskollektion von quoteSalute wird in der Variable $data hinterlegt. Z. 7: Das Ergebnis der gesamten Operation. Hier wird der gesamte quoteSalute-Korpus durchsucht. Dabei sollen alle Elemente aus allen Dateien ausgeliefert werden \/\/, die den Tag-Namen tei:TEI haben. Ergebnisse in eXide Sie können sich die XML-Ergebnisse direkt in eXide anzeigen lassen. Lesen Sie sich den Code durch Drücken Sie auf den Eval-Button in der Toolbar. Es erscheint unter dem Editor-Bereich ein Ergebnisbereich. Dort werden Ihnen die abfragten Daten angezeigt. Siehe auch Aufbau von eXide. Ergebnisse im Browser Sie können sich die XML-Ergebnisse auch anders über Ihren Browser anzeigen lassen. Öffnen Sie einen neuen Browsertab. Geben Sie folgende URL ein: http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-01.xql. In diesem Fall erhalten Sie noch kein wohlgeformtes XML zurück. Weiter mit Schritt 4. Lassen Sie sich den Seitenquelltext anzeigen um ans rohe XML zu gelangen. a. Firefox und Chrome - Strg + U oder Rechtsklick -&gt; Seitenquelltext anzeigen.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Den_quoteSalute_Korpus_abfragen.html"},{"title":"Challenge 1 - Eine Grußformel abrufen","text":"Challenge 1: Eine Grußformel abrufen Aufgabe Gegeben Lösungsstrategien Challenge 1: Eine Grußformel abrufen Aufgabe Versuchen Sie die Datenbankabfrage in der Datei abfrage-challenge-01.xql so zu manipulieren, dass nur noch eine einzige Grußformel (die erste) zurückgeliefert wird. Gegeben abfrage-challenge-01.xql Die Datei ist schon so manipuliert, dass nur der 3. Treffer aus einer Trefferkollektion zurückgegeben wird. xquery version &quot;3.0&quot;; (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; (: TODO: Die erste Grußformel aus dem quoteSalute Korpus holen :) return (collection($data)\/\/tei:TEI)[3] Lösungsstrategien Öffnen Sie die Datei abfrage-challenge-01.xql mit eXide. Schauen Sie sich eine der Dateien im quoteSalute-Korpus an. Der Pfad ist in der $data-Variable hinterlegt. Öffnen Sie mit eXide eine Datei aus diesem Pfad. Schauen Sie sich die XML-Struktur an. Identifizieren Sie den Namen des XML-Elements, welches eine Grußformel samt seiner Metadaten umschließt. Passen Sie das return-Statement in der XQuery-Datei in eXide an.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Challenge_1_-_Eine_Grußformel_abrufen.html"},{"title":"Challenge 1 - Lösung","text":"Challenge 1: Lösung Erläuterung Challenge 1: Lösung Hier ist unsere Musterlösung zur Challenge 1. xquery version &quot;3.0&quot;; (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; (: TODO: Das erste Zitat aus dem quoteSalute Korpus holen :) return (collection($data)\/\/tei:cit)[1] Erläuterung Das Element, welches alle Informationen zu einem Zitat beinhaltet ist tei:cit. Hole alle tei:cit-Elemente wird zu \/\/tei:cit. Die eckigen Klammern am Ende deuten an, welche Position in der Ergebnisliste zurückgegeben werden soll. Vorher: [3] - 3. Position Nachher: [1] - 1. Position","tags":"","url":"XML_zu_JSON_in_eXist-db\/Challenge_1_-_Lösung.html"},{"title":"Eine zufällige Grußformel generieren","text":"Eine zufällige Grußformel generieren Neuerungen im Code Erläuterungen Code Eine zufällige Grußformel generieren In diesem Abschnitt wird die Erklärung zur Datei abfrage.xql erweitert. Es wird gezeigt, wie ein zufälliges Element aus einer Ergebniskollektion ausgewählt werden kann. Neuerungen im Code Öffnen Sie die Datei abfrage-tutorial-02.xql in eXide. Schauen Sie sich Code und Kommentare an. Führen Sie den Code aus. Lassen Sie sich das Ergebnis in eXide oder im Browser anzeigen. Was hat sich im Vergleich zu abfrage-tutorial-01.xql geändert? Erläuterungen Z. 9: Wir speichern vorerst alle Ergebnisse in eine Variable $greetings. let $greetings := collection($data)\/\/tei:cit Z. 12: Wir zählen erst alle Ergebnisse mit count($greetings). Mit util:random() wird dann eine zufällige Zahl zwischen 0 und der Anzahl der Ergebnisse ausgewählt. let $random := util:random(count($greetings)) Z. 15-18: XQuery kann mit einer &quot;0. Position&quot; nichts anfangen. Dieser Code-Block stellt sicher, dass die Zufallszahl mindestens 1 ist. In anderen Worten: Wenn die Zufallszahl größer oder gleich 1 ist, liefere die Zufallszahl zurück. Falls nicht (also 0 oder kleiner), liefere 1 zurück. let $cleanRandom := if ($random &gt;= 1) then $random else 1 Z. 21: Wähle die Grußformel an der zufällig bestimmten Position aus der Ergebnisliste let $randomcit := $greetings[position()=$cleanRandom] Z. 24: Liefere die zufällige Grußformel als XML zurück. return $randomcit Code xquery version &quot;3.0&quot;; (: FLOWR for let order where return :) (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; let $greetings := collection($data)\/\/tei:cit (: Wähle eine zufällige Position aus der Ergebnisliste :) let $random := util:random(count($greetings)) (: Stelle sicher, dass auch wirklich nur ein Ergebnis ausgewählt wurde :) let $cleanRandom := if ($random &gt;= 1) then $random else 1 (: Hole die Grußformel an der Stelle :) let $randomcit := $greetings[position()=$cleanRandom] (: Gib die zufällige Grußformel zurück :) return $randomcit","tags":"","url":"XML_zu_JSON_in_eXist-db\/Eine_zufällige_Grußformel_generieren.html"},{"title":"XML zu JSON","text":"XML zu JSON Neuerungen im Code Erläuterungen Code XML zu JSON In diesem Abschnitt wird die Erklärung zur Datei abfrage.xql erweitert. Es wird gezeigt, wie XML-Daten zu JSON serialisiert werden können. Neuerungen im Code Öffnen Sie die Datei abfrage-tutorial-03.xql in eXide. Schauen Sie sich Code und Kommentare an. Führen Sie den Code aus. Lassen Sie sich das Ergebnis in eXide oder im Browser anzeigen. Was hat sich im Vergleich zu abfrage-tutorial-02.xql geändert? Erläuterungen Z. 5-8: Wir wollen das XML-Ergebnis am Ende nach JSON serialisieren. Der output-Namensraum wird benötigt, um Daten in ein anderes Format zu serialisieren. Mit der Option exist:serialize zeigen wir der eXist-db an, dass später im Code eine Datenserialisierung erfolgen soll und die dementsprechenden Funktionen bereitgehalten werden sollen. declare namespace output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;; (: Serialisierung nach JSON als Ergebnisziel angeben :) declare option exist:serialize &quot;media-type=application\/json&quot;; Z. 10-27: Dies ist eine interne Helferfunktion, welche XML-Daten bereinigt. Dabei wird sämtlicher Textinhalt aus einem Element und seinen Kinderelementen zu einem Text zusammengefügt. Vorher Nachher &lt;div&gt;Das ist &lt;a href=&quot;#&quot;&gt;das Haus&lt;\/a&gt; vom Nikolaus.&lt;\/div&gt; &lt;div&gt;Das ist das Haus vom Nikolaus.&lt;\/div&gt; Schauen wir uns ein Beispielzitat aus dem Korpus an: &lt;cit&gt; &lt;quote ana=&quot;#formal #s-m #r-n&quot; xml:lang=&quot;deu&quot;&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/quote&gt; &lt;bibl&gt; &lt;title type=&quot;edition&quot;&gt;Jean Paul – Sämtliche Briefe digital&lt;\/title&gt; &lt;title type=&quot;letter&quot;&gt;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&lt;\/title&gt; &lt;ref target=&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot;\/&gt; &lt;\/bibl&gt; &lt;\/cit&gt; Z. 46-52: Die Inhalte und Metadaten zur zufällig ausgewählten Grußformel werden in separaten Variablen gespeichert. Dabei werden die Inhalte mit normalize-space() und local:clean-up() bereinigt, um z.B. Zeilenumbrüche und ggf. doppelt vorkommende Leerstellen zu entfernen. Der Inhalt der Variable $quote wird in diesem Fall dann &lt;quote&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/quote&gt; sein. Das gilt analog für die anderen Variablen. let $quote := element quote { normalize-space(string-join(local:clean-up($randomcit\/tei:quote))) } let $edition := element edition { normalize-space($randomcit\/\/tei:title[@type='edition']) } let $title := element title { normalize-space($randomcit\/\/tei:title[@type='letter']) } let $language := element language { normalize-space($randomcit\/\/tei:quote\/@xml:lang) } let $url := element url { $randomcit\/\/tei:bibl\/tei:ref\/@target\/data(.) } let $licence := element licence { $randomcit\/\/tei:licence\/@target\/data(.) } Z. 54: Wir erstellen ein neues Element &lt;cit&gt; mit den bereinigten Inhalten aus den Statements zuvor. let $preparedGreeting := element cit {$quote,$edition,$title,$url,$language,$licence} Der Inhalt von $preparedGreeting sollte dann mit dem Beispiel oben wie folgt aussehen: &lt;cit&gt; &lt;quote&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/quote&gt; &lt;edition&gt;Jean Paul – Sämtliche Briefe digital&lt;\/edition&gt; &lt;title&gt;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&lt;\/title&gt; &lt;url&gt;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&lt;\/url&gt; &lt;language&gt;deu&lt;\/language&gt; &lt;licence&gt;&lt;\/licence&gt; &lt;\/cit&gt; Z. 57-63: Hier werden die JSON-Serialisierungsparameter angegeben. D.h., hier wird bestimmt, wie der JSON-Output am Ende aussehen soll. let $jsonSerializationParams := &lt;output:serialization-parameters xmlns:output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;&gt; &lt;output:method value=&quot;json&quot;\/&gt; &lt;output:media-type value=&quot;application\/json&quot;\/&gt; &lt;output:json-ignore-whitespace-text-nodes value=&quot;yes&quot;\/&gt; &lt;\/output:serialization-parameters&gt; Z. 66-67: Die berenigten XML-Daten in $preparedGreeting werden mit den von uns vorgegebenen JSON-Serialisierungsparametern $jsonSerializationParams nach JSON umgeformt. return serialize($preparedGreeting, $jsonSerializationParams) Das JSON-Ergebnis sieht wie folgt aus: { &quot;quote&quot;:&quot;Mit Verehrung Ihr ergebenster etc.&quot;, &quot;edition&quot;:&quot;Jean Paul – Sämtliche Briefe digital&quot;, &quot;title&quot;:&quot;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&quot;, &quot;url&quot;:&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot;, &quot;language&quot;:&quot;deu&quot;, &quot;licence&quot;:null } Code xquery version &quot;3.0&quot;; (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; declare namespace output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;; (: Serialisierung nach JSON als Ergebnisziel angeben :) declare option exist:serialize &quot;media-type=application\/json&quot;; (: Helferfunktion um Datenstrukturen zu bereinigen :) declare function local:clean-up($nodes as node()*) as xs:string* { for $node in $nodes return typeswitch($node) case element(tei:lb)|element(tei:abbr)|element(tei:reg)|element(tei:note) return () case element() return local:clean-up($node\/node()) case text() return $node default return local:clean-up($node\/node()) }; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; let $greetings := collection($data)\/\/tei:cit (: Wähle eine zufällige Position aus der Ergebnisliste :) let $random := util:random(count($greetings)) (: Stelle sicher, dass auch wirklich nur ein Ergebnis ausgewählt wurde :) let $cleanRandom := if ($random &gt;= 1) then $random else 1 (: Hole die Grußformel an der Stelle :) let $randomcit := $greetings[position()=$cleanRandom] (: Erstelle Variablen für die Inhalte und Metdaten zu einer Grußformel :) let $quote := element quote { normalize-space(string-join(local:clean-up($randomcit\/tei:quote))) } let $edition := element edition { normalize-space($randomcit\/\/tei:title[@type='edition']) } let $title := element title { normalize-space($randomcit\/\/tei:title[@type='letter']) } let $language := element language { normalize-space($randomcit\/\/tei:quote\/@xml:lang) } let $url := element url { $randomcit\/\/tei:bibl\/tei:ref\/@target\/data(.) } let $licence := element licence { $randomcit\/\/tei:licence\/@target\/data(.) } let $preparedGreeting := element cit {$quote,$edition,$title,$url,$language,$licence} (: Bestimmte wie die JSON-Serializierung aussehen soll :) let $jsonSerializationParams := &lt;output:serialization-parameters xmlns:output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;&gt; &lt;output:method value=&quot;json&quot;\/&gt; &lt;output:media-type value=&quot;application\/json&quot;\/&gt; &lt;output:json-ignore-whitespace-text-nodes value=&quot;yes&quot;\/&gt; &lt;\/output:serialization-parameters&gt; (: Serialisiere das zufällige XML-cit-Element nach JSON :) return serialize($preparedGreeting, $jsonSerializationParams)","tags":"","url":"XML_zu_JSON_in_eXist-db\/XML_zu_JSON.html"},{"title":"Abfragen mit Filtern","text":"Abfragen mit Filtern Neuerungen im Code URL-Parameter Einzelner Filter - Briefe von Frauen Mehrere Filter - Briefe von Frauen an Frauen (oder neutral) Erläuterungen Code Abfragen mit Filtern In diesem Abschnitt wird die Erklärung zur Datei abfrage.xql erweitert. Es wird gezeigt, wie Daten aus dem quoteSalute nach bestimmten Eigenschaften gefiltert werden können, sodass z.B. nur Grußformeln von Frauen als Absender ausgewählt werden. Neuerungen im Code Öffnen Sie die Datei abfrage-tutorial-04.xql in eXide. Schauen Sie sich Code und Kommentare an. Führen Sie den Code aus. Lassen Sie sich das Ergebnis in eXide oder im Browser anzeigen. Was hat sich im Vergleich zu abfrage-tutorial-03.xql geändert? Wenn Sie den Code mit eXide ausführen, sollte sich im Ergebnis nichts sichtbares geändert haben. Sie können jedoch URL-Parameter angeben, um Daten zu filtern. URL-Parameter Überfliegen Sie kurz die Dokumentation von quoteSalute. Einzelner Filter - Briefe von Frauen Sie können über die Browser-URL Parameter (nutzerspezifizierte Werte) an das quoteSalute-Back-End übergeben. Das grundlegende Prinzip ist folgendermaßen: [URL]?parameter=wert. Mit dem ? wird angezeigt, dass Parameter übergeben werden sollen. Öffnen Sie folgende URL in einem neuen Browser-Tab: http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql Sie sollten eine Grußformel als JSON erhalten. Erweitern Sie die URL mit ?sender=s-f. (s für &quot;sender&quot; und f für &quot;female&quot;) Ihre URL sollte jetzt http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql?sender=s-f lauten. Im title-Feld sollten Sie nachvollziehen können, dass nur noch Grußformeln von Briefen angezeigt werden, deren Verfasser Frauen waren. Laden Sie den Tab mit F5 neu, um sich eine andere zufällige Grußformel anzeigen zu lassen. Mehrere Filter - Briefe von Frauen an Frauen (oder neutral) Sie können auch mehrere Parameter über die Browser-URL übergeben. Das grundlegende Prinzip ist folgendermaßen [URL]?parameter1=wert1&amp;parameter2=wert2. Mit dem &amp; werden Parameterpaare getrennt. Öffnen Sie folgende URL in einem neuen Browser-Tab: http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql?sender=s-f Sie sollten eine Grußformel als JSON erhalten. Erweitern Sie die URL mit &amp;receiver=r-fXr-n. Ihre URL sollte jetzt http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql?sender=s-f&amp;receiver=r-fXr-n Anhand der Daten sollten Sie nachvollziehen können, dass nur noch Grußformeln von Briefen angezeigt werden, deren Verfasser Frauen waren und deren Empfänger entweder auch Frauen waren bzw. so formuliert sind, dass sich das Geschlecht des Empfängers nicht bestimmen lässt. Laden Sie den Tab mit F5 neu, um sich eine andere zufällige Grußformel anzeigen zu lassen. Erläuterungen Z. 12-15: Wir teilen der eXist-db mit, dass die Werte von URL-Parametern in Variablen gespeichert werden sollen, falls diese vorkommen. Zum Beispiel wird in $sender der Wert s-f gespeichert, wenn die Anfrage von der URL http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql?sender=s-f kommt. Folgende URL-Parameter werden akzeptiert: type - Höflichkeitsstufe sender - Geschlecht der absendenden Person receiver - Geschlecht der empfangenden Person language - Sprache, in welcher die Grußformel verfasst wurde declare variable $type := request:get-parameter('type', ()); declare variable $sender := request:get-parameter('sender', ()); declare variable $receiver := request:get-parameter('receiver', ()); declare variable $language := request:get-parameter('language', ()); Z. 39-76: Hier werden die URL-Parameterwerte für eine Datenbankabfrage aufbereitet, sodass der quoteSalute-Korpus entsprechend gefiltert werden kann. In dem Code-Schnipsel werden nur type, sender und receiver aufbereitet. Der langauge-Filter ist die nächste Challenge. In Code-Blöcken zu $type-contains, $sender-contains und $receiver-contains werden Mehrfachnennungen der URL-Parameter aufbereitet. Z.B. wird aus dem URL-Parameter ?receiver=r-fXr-n die XQuery-Schnipsel contains(.\/\/@ana, &quot;#r-f&quot;) und contains(.\/\/@ana, &quot;#r-n&quot;). In den Code-Blöcken zu $filter-type, $filter-sender und $filter-receiver werden diese XQuery-Schnipsel dann zu einer Filter-Datenbankanfrage zusammengefügt. Z.B. entsteht dann folgender Wertschnipsel: contains(.\/\/@ana, &quot;#r-f&quot;) or contains(.\/\/@ana, &quot;#r-n&quot;). Also liefere nur Grußformeln zurück, welche im @ana-Attribut die Werte #r-f oder #r-n enthalten. (: START - Höflichkeitsfilter vorbereiten :) let $type-contains := for $item in tokenize($type, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-type := if (count($type) &gt;= 1) then let $containQuery := string-join($type-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Höflichkeitsfilter vorbereiten :) (: START - Absenderfilter vorbereiten :) let $sender-contains := for $item in tokenize($sender, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-sender := if (count($sender) &gt;= 1) then let $containQuery := string-join($sender-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Absenderfilder vorbereiten :) (: START - Empfängerfilter vorbereiten :) let $receiver-contains := for $item in tokenize($receiver, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-receiver := if (count($receiver) &gt;= 1) then let $containQuery := string-join($receiver-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Empfängerfilter vorberiten :) Z. 78: Bereite eine Abfrage (engl. query) vor, indem die bisher bekannte Anfrage collection($data)\/\/tei:cit mit den Filtern erweitert wird. Die ||-Zeichen bedeuten, dass die Werte der dahinterliegenden Variablen und Ausdrücke an die Abfrage rangefügt werden sollen. let $query := ('collection($data)\/\/tei:cit'||$filter-type||$filter-sender||$filter-receiver) Z. 79: Nun holen wir eine Kollektion an Grußformeln, auf die die Filter passen. let $greetings := util:eval($query) Der Rest der Datei ist wie bisher und folgt derselben Logik. Code xquery version &quot;3.0&quot;; (: Deklaration von Namensräumen. Wichtig für die Arbeit mit TEI-XML-Daten :) declare namespace tei=&quot;http:\/\/www.tei-c.org\/ns\/1.0&quot;; declare namespace output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;; (: Serialisierung nach JSON als Ergebnisziel angeben :) declare option exist:serialize &quot;media-type=application\/json&quot;; (: Request-Parameter entgegenennehmen. Wenn von einer Webseite eine Anfrage kommt, : können nutzerdefinierte Angaben mit überreicht werden. :) declare variable $type := request:get-parameter('type', ()); declare variable $sender := request:get-parameter('sender', ()); declare variable $receiver := request:get-parameter('receiver', ()); declare variable $language := request:get-parameter('language', ()); (: Helferfunktion um Datenstrukturen zu bereinigen :) declare function local:clean-up($nodes as node()*) as xs:string* { for $node in $nodes return typeswitch($node) case element(tei:lb)|element(tei:abbr)|element(tei:reg)|element(tei:note) return () case element() return local:clean-up($node\/node()) case text() return $node default return local:clean-up($node\/node()) }; (: Variable zum Speichern des Daten-Verzeichnispfads :) let $data := &quot;\/db\/apps\/quotesalute\/data&quot; (: START - Höflichkeitsfilter vorbereiten :) let $type-contains := for $item in tokenize($type, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-type := if (count($type) &gt;= 1) then let $containQuery := string-join($type-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Höflichkeitsfilter vorbereiten :) (: START - Absenderfilter vorbereiten :) let $sender-contains := for $item in tokenize($sender, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-sender := if (count($sender) &gt;= 1) then let $containQuery := string-join($sender-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Absenderfilder vorbereiten :) (: START - Empfängerfilter vorbereiten :) let $receiver-contains := for $item in tokenize($receiver, 'X') let $contain := concat(&quot;#&quot;, $item) return concat('contains(.\/\/@ana, &quot;', $contain, '&quot;)') let $filter-receiver := if (count($receiver) &gt;= 1) then let $containQuery := string-join($receiver-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Empfängerfilter vorberiten :) let $query := ('collection($data)\/\/tei:cit'||$filter-type||$filter-sender||$filter-receiver) let $greetings := util:eval($query) (: Wähle eine zufällige Position aus der Ergebnisliste :) let $random := util:random(count($greetings)) (: Stelle sicher, dass auch wirklich nur ein Ergebnis ausgewählt wurde :) let $cleanRandom := if ($random &gt;= 1) then $random else 1 (: Hole die Grußformel an der Stelle :) let $randomcit := $greetings[position()=$cleanRandom] (: Erstelle Variablen für die Inhalte und Metdaten zu einer Grußformel :) let $quote := element quote { normalize-space(string-join(local:clean-up($randomcit\/tei:quote))) } let $edition := element edition { normalize-space($randomcit\/\/tei:title[@type='edition']) } let $title := element title { normalize-space($randomcit\/\/tei:title[@type='letter']) } let $language := element language { normalize-space($randomcit\/\/tei:quote\/@xml:lang) } let $url := element url { $randomcit\/\/tei:bibl\/tei:ref\/@target\/data(.) } let $licence := element licence { $randomcit\/\/tei:licence\/@target\/data(.) } let $preparedGreeting := element cit {$quote,$edition,$title,$url,$language,$licence} (: Bestimmte wie die JSON-Serializierung aussehen soll :) let $jsonSerializationParams := &lt;output:serialization-parameters xmlns:output=&quot;http:\/\/www.w3.org\/2010\/xslt-xquery-serialization&quot;&gt; &lt;output:method value=&quot;json&quot;\/&gt; &lt;output:media-type value=&quot;application\/json&quot;\/&gt; &lt;output:json-ignore-whitespace-text-nodes value=&quot;yes&quot;\/&gt; &lt;\/output:serialization-parameters&gt; (: Serialisiere das zufällige XML-cit-Element nach JSON :) return serialize($preparedGreeting, $jsonSerializationParams)","tags":"","url":"XML_zu_JSON_in_eXist-db\/Abfragen_mit_Filtern.html"},{"title":"Challenge 2 - Ein neuer Filter","text":"Challenge 2: Ein neuer Filter Aufgabe Lösungsansätze Challenge 2: Ein neuer Filter Im Abschnitt zuvor wurden Filter zu Höflichkeit, Sender und Empfänger eingerichtet. In dieser Challenge soll ein Sprach-Filter hinzugefügt werden. Aufgabe Erweitern Sie die Datei abfrage-challenge-02.xql. Fügen Sie einen Sprach-Filter hinzu. Orientieren Sie sich dabei an die bisherigen Filter. Überprüfen Sie, ob Ihr Code funktioniert, indem Sie folgende URL im Browser aufrufen: http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-tutorial-04.xql?language=eng. Wenn Sie nach mehrmaligem Neuladen der Seite nur englische Grußformeln angezeigt bekommen, ist ihr Code-Richtig. Lösungsansätze In der Variable $language wird der Sprachwert gespeichert. Dieser kann leer sein, oder z.B. deu, eng oder ita sein. Führen Sie analog zu den bisherigen Filter-Schritten die Variablen $language-contains und $filter-langauge ein. Erweitern Sie die $query-Variable Ergebnis im Browser überprüfen.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Challenge_2_-_Ein_neuer_Filter.html"},{"title":"Challenge 2 - Lösung","text":"Challenge 2: Lösung Erläuterung Challenge 2: Lösung Hier ist unsere Musterlösung zur Challenge 2. Erläuterung Analog zu den anderen Filtern wurde der Sprach-Parameter für eine spätere Datenbankabfrage aufbereitet: (: START - Sprachfilter vorbereiten :) let $language-contains := for $item in tokenize($language, 'X') return concat('contains(.\/\/@xml:lang, &quot;', $item, '&quot;)') let $filter-language := if (count($language) &gt;= 1) then let $containQuery := string-join($language-contains, ' or ') return concat('[', $containQuery, ']') else () (: ENDE - Sprachfilter vorbereiten :) Anschließend wurde die $query-Datenbankabfragevariable erweitert. let $query := ('collection($data)\/\/tei:cit'||$filter-type||$filter-sender||$filter-receiver||$filter-language) Ruft man nun http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-challenge-02-solution.xql?language=eng auf, erscheinen nur Grußformeln auf Englisch.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Challenge_2_-_Lösung.html"},{"title":"Zusammenfassung","text":"Zusammenfassung Zusammenfassung In diesem Kapitel haben Sie gelernt, wie man in eXist-db eXide bedient, den quoteSalute-XML-Korpus mit TEI abfragt, zufällige Grußformeln extrahiert, XML zu JSON transformiert und Datenbankabfragen mit Filtern versieht. Sie haben Ihr Wissen getestet und folgende Challenges absolviert: Challenge 1: Eine Grußformel abrufen Challenge 2: Ein neuer Filter Im folgenden Kapitel werden die ersten Schritte mit VueJS erklärt, sodass im finalen Kapitel die Verbindung von VueJS und eXist-db vollzogen werden kann. Vorerst müssen Sie keine weiteren Änderungen mit eXide vornehmen.","tags":"","url":"XML_zu_JSON_in_eXist-db\/Zusammenfassung.html"},{"title":"Übersicht","text":"Übersicht Übersicht In diesem Kapitel werden die Grundzüge von VueJS vorgestellt. Zuerst wird das technische Setup besprochen. Für dieses Kapitel benötigen Sie grundlegendes Wissen in der Webprogrammierung mit HTML und JavaScript (kurz JS). Sie werden lernen, wie man VueJS in ein HTML-Dokument einbindet, Daten und Templates in einer VueJS-Instanz verwaltet (model binding), Templates mit if-Konditionen und for-Schleifen manipuliert, VueJS-Instanz-interne Funktionen und mit On-Click-Events interaktiv gestaltet, sowie sog. Computed Properties, d.h. sich stetig aktualisierende Variablen, anwendet. Die Code-Beispiele in diesem Kapitel sind etwas vom quoteSalute-Inhalt losgelöst. Im folgenden und finalen Kapitel werden dann eXist-db und VueJS miteinander verbunden, um das quoteSalute-Front-End zu realisieren.","tags":"","url":"Erste_Schritte_mit_VueJS\/Übersicht.html"},{"title":"Vorbereitung für VueJS","text":"Vorbereitung für VueJS Beispieldateien Software Firefox Google Chrome Vorbereitung für VueJS Beispieldateien Wir haben Code-Skelette zum Nachvollziehen vorbereitet. Laden Sie folgende Datei herunter und entpacken Sie das ZIP-Archiv auf Ihrem Rechner. Alle Beispiele in diesem Kapitel beziehen sich auf Dateien aus diesem Archiv. vue-examples.zip Die Abhängigkeiten aus den Code-Beispielen werden mitgeliefert. Sämtlicher JavaScript-Code wird in einem &lt;script&gt;-Block am Ende des &lt;body&gt;-Tags verwaltet, sodass HTML und JavaScript für dieses Tutorial eine geschlossene Einheit bilden. Software Ein moderner Browser, z.B. Mozilla Firefox oder Google Chrome (nicht Internet Explorer!) Ein Code-Editor, z.B. Visual Studio Code, Atom oder Notepad++ Firefox Mit Firefox sollte alles problemlos funktionieren. Optional: Vue.js devtools Google Chrome Sollten Sie Google Chrome (oder Chromium) verwenden, installieren Sie bitte folgende Erweiterung: Web Server for Chrome Wenn Sie JavaScript in HTML-Dateien benutzen möchten, die auf Ihrer lokalen Festplatte liegen, blockiert Chrome aus Sicherheitsgründen dessen ausführung. Mit dieser Erweiterung schaffen Sie lokal einen &quot;Mini-Server&quot; für ausgewählte Dateien, um JavaScript lokal im Browser auszuführen. Optional: Vue.js devtools","tags":"","url":"Erste_Schritte_mit_VueJS\/Vorbereitung_für_VueJS.html"},{"title":"VueJS benutzen","text":"VueJS benutzen Grundlagen VueJS im HTML-Dokument Code VueJS benutzen In diesem Abschnitt wird kurz beschrieben, was VueJS ist und wie es benutzt werden kann. Zugehörige Beispieldatei: 02_VueJS_benutzen.html Grundlagen VueJS ist eine JavaScript-Software-Bibliothek, welche sich mit anderen Bibliotheken wie React oder AngularJS vergleichen lässt. Das grundlegenste Ziel von VueJS ist es, Webseiten reaktiv zu gestalten. Die HTML-Daten werden dabei auf dem Rechner des Nutzers on-the-fly berechnet. Dabei interagieren das Datenmodell und die VueJS-DOM (VueJS-HTML-Templates) miteinander. Ändert sich ein Wert im Datenmodell, ändern sich auch alle Anzeigen, wo dieser Wert referenziert ist. VueJS im HTML-Dokument Um VueJS im eigenen JavaScript-Code nutzen zu können, muss es im HTML-Dokument importiert werden. Derzeit ist es gängig JavaScript nicht im &lt;head&gt;-Element, sondern am Ende des &lt;body&gt;-Tags zu importieren. Im body-Bereich legen wir ein div-Element mit der ID root an. Dieses soll als Ziel-Element für unsere Vue-Instanz dienen. &lt;div id=&quot;root&quot;&gt; &lt;!-- Hier kann VueJS zugreifen--&gt; &lt;\/div&gt; Wir laden die VueJS-Bibliothek und erstellen eine neue Vue-Instanz. Über den el-Parameter teilen wir mit, auf welches Element sich die Vue-Instanz beschränken soll. In diesem Fall das Element mit der ID &quot;root&quot;, also #root. const vue = new Vue({ el: '#root' }); Code Zugehörige Beispieldatei: 02_VueJS_benutzen.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: VueJS einbinden&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;VueJS einbinden&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;!-- Hier kann VueJS zugreifen--&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root' }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/VueJS_benutzen.html"},{"title":"Data und Templates","text":"Data und Templates Data Templates Aufgabe Code Data und Templates In diesem Abschnitt wird beschrieben, wie man das Datenmodell in einer VueJS-Instanz verwaltet und im HTML-Code nutzbar macht. Zugehörige Beispieldatei: 03_Data_und_Templates.html Data Die Vue-Instanz ähnelt vom Aufbau einem JSON-Objekt. Das data-Element verwaltet das interne Datenmodell der Vue-Instanz. Nach dem Key-Value-Prinzip können hier neue Variablen angelegt werden. Der data-Variable name wird der Wert Alexander von Humboldt zugeordnet. Der data-Variable shoppingList eine Liste mit den Werten Bananen, Brot und Schokolade. const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ] } }); Zwar sind die Variablen nun vorhanden, jedoch noch nicht angezeigt. Templates Auf die Variablen kann im Vue-Bereich des HTML-Codes nun zugegriffen werden. Mit {{ variable }} wird der Wert einer Variable ausgegeben. {{ name }} wird also automatisch mit Alexander von Humboldt ersetzt. Man kann auch über Listen iterieren. Für jeden Eintrag item in der Einkaufliste shoppingList erstelle ein Listenelement &lt;li&gt; und trage dort den Wert von item ein. Die v-Direktiven werden wie normale HTML- bzw. XML-Attribute behandelt, d.h. die Werte sind von &quot; &quot; umschlossen. &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; Der gesamte Code-Schnipsel sieht also wie folgt aus. &lt;div id=&quot;root&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; &lt;\/ul&gt; &lt;\/div&gt; &lt;\/div&gt; Wenn Sie die Datei mit Ihrem Browser öffnen, sollte folgender Output zu sehen sein. Mein Name ist Alexander von Humboldt. Meine Einkaufsliste lautet: Bananen Brot Schokolade Aufgabe Öffnen Sie die Datei 03_Data_und_Templates.html mit ihrem Browser (rechtsklick -&gt; Öffnen mit...) Öffnen Sie die Datei 03_Data_und_Templates.html mit einem Text-Editor. Ändern Sie die Werte im data-Element in der Vue-Instanz. Fügen Sie weitere Werte zur Einkaufsliste hinzu. Speichern Sie das HTML-Dokument. Laden Sie die Seite in Ihrem Browser neu. Haben sich die Werte geändert? Code Zugehörige Beispieldatei: 03_Data_und_Templates.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Data und Templates&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Data und Templates&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; &lt;\/ul&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ] } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Data_und_Templates.html"},{"title":"Challenge 1 - Anzeige mit Bedingungen","text":"Challenge 1: Anzeige mit Bedingungen Aufgabe Lösungsstrategien Challenge 1: Anzeige mit Bedingungen Aufgabe Versuchen Sie den VueJS-HTML-Code so anzupassen, dass nur Gegenstände von der Einkaufsliste angezeigt werden, wenn sie mit 'B' beginnen. Wenn der Gegenstand nicht mit 'B' beginnt, soll der Eintrag mit Geheim! ersetzt werden. Zugehörige Beispieldatei: 04_Challenge_1.html Lösungsstrategien Mit dem v-if-Attribut kann eine Bedingung formuliert werden. Eine Alternative kann mit dem v-else-Attribut angegeben werden. v-if kann im selben Element wie v-for vorkommen. Siehe auch: Vue: Conditional Rendering (engl.) Zum Beispiel: &lt;!-- angenommen: anzahl = 3 --&gt; &lt;div&gt; Ich möchte {{ anzahl }} &lt;span v-if=&quot;anzahl &gt; 1&quot;&gt;Bücher&lt;\/span&gt; &lt;span v-else&gt;Buch&lt;\/span&gt; kaufen &lt;\/span Mit der JavaScript-Funktion startsWith können Sie überprüfen, ob eine Zeichenkette mit einem bestimmten Buchstaben beginnt. Wenden Sie diese Funktion auf item an. const name = 'Alexander von Humboldt'; name.startsWith('A') \/\/ true","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_1_-_Anzeige_mit_Bedingungen.html"},{"title":"Challenge 1 - Lösung","text":"Challenge 1: Lösung Erläuterung Challenge 1: Lösung Hier ist unsere Musterlösung zur Challenge 1: Anzeige mit Bedingungen. &lt;div id=&quot;root&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot; v-if=&quot;item.startsWith('B')&quot;&gt;{{ item }}&lt;\/li&gt; &lt;li v-else&gt;Geheim!&lt;\/li&gt; &lt;\/ul&gt; &lt;\/div&gt; &lt;\/div&gt; Erläuterung Mit dem Vue-Attribut v-if=&quot;item.startsWith('B') wird geprüft, ob der anzuzeigende Gegenstand in der Einkaufsliste mit 'B' beginnt. Diese Prüfung wird für jeden Eintrag in der Einkaufsliste vorgenommen. Falls die Prüfung fehlschlägt, greift die v-else-Direktive.","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_1_-_Lösung.html"},{"title":"Vue Models - Daten eingeben","text":"Vue Models - Daten eingeben Formulare und VueJS Austesten Code Vue Models - Daten eingeben In diesem Abschnitt wird gezeigt, wie man HTML-Formulare ans Vue Datenmodell data anbindet. Zugehörige Beispieldatei: 06_Vue_Models_-_Daten_eingeben.html Formulare und VueJS Im Schritt zu Data und Templates wurde gezeigt, wie man Variablen im data-Bereich von VueJS einrichtet und diese im HTML-Code nachnutzt. Nun soll gezeigt werden, wie man Variablen im data-Bereich über HTML-Formulare ändern kann. Nutzereingaben erfolgen in &lt;input&gt;-Elementen. Mit dem v-model-Attribut können wir eine data-Variable Referenzieren. Dazu legen wir ein neues Formular an und referenzieren die Namensvariable mit dem Attribut v-model=&quot;name&quot;. Immer wenn sich der Wert in dem Input ändern, ändert sich der Wert der Variable im data-Bereich. &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; Austesten Öffnen Sie die Datei 06_Vue_Models_-_Daten_eingeben.html mit einem Browser. Geben Sie einen Namen in das Eingabefeld ein. Beobachten Sie den &quot;Hallo...&quot;-Text. Ändert er sich, während Sie etwas eingeben? Code Zugehörige Beispieldatei: 06_Vue_Models_-_Daten_eingeben.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Challenge 1 - Lösung&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Challenge 1: Lösung&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot; v-if=&quot;item.startsWith('B')&quot;&gt;{{ item }}&lt;\/li&gt; &lt;li v-else&gt;Geheim!&lt;\/li&gt; &lt;\/ul&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ] } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Vue_Models_-_Daten_eingeben.html"},{"title":"Vue Methods - Funktionen auf Abruf","text":"Vue Methods - Funktionen auf Abruf Methoden nutzen Ziel Vorgehen Aufgabe Code Vue Methods - Funktionen auf Abruf In diesem Abschnitt wird erklärt, wie man den methods-Bereich einer Vue-Instanz benutzt. Zugehörige Beispieldatei: 07_Vue_Methods_-_Funktionen_auf_Abruf.html Methoden nutzen Im vergangenen Abschnitt wurde gezeigt, wie man das Vue data model in HTML-Formularen manipulierbar macht. Dort wurde die Variable &quot;live&quot; beobachtet und aktualisiert. Hier soll demonstriert werden, die man eine Funktion auf Abruf, z.B. auf einen Button-Klick, einrichtet. Ziel Die Einkaufsliste soll auf einen Button-Klick geleert werden. Vorgehen Wir fügen einen Button im HTML-Code hinzu. &lt;button class=&quot;btn btn-primary&quot;&gt;Liste leeren&lt;\/button&gt; Wir erstellen den methods-Bereich in unserer VueJS-Instanz und fügen eine neue Funktion emptyList() hinzu. Wird die Funktion emptyList() ausgeführt, wird die Einkaufslistenvariable shoppingList geleert, indem die Einträge durch eine leere Liste ersetzt werden. Innerhalb der Vue-Instanz bezieht sich this auf sämtliche Vue-internen Informationen, wie data, methods und computed Properties (siehe hier) const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ] }, methods: { emptyList() { this.shoppingList = []; } } }); Nun fügen wir zum neuen Button einen Event-Listener hinzu. Mit der Attribut-Direktive v-on:click können wir eine Methode angeben. &lt;button class=&quot;btn btn-primary&quot; v-on:click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; Diese Direktive kann auch verkürzt werden zu @click. &lt;button class=&quot;btn btn-primary&quot; @click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; Aufgabe Öffnen Sie die Datei 07_Vue_Methods_-_Funktionen_auf_Abruf.html. Klicken Sie auf den &quot;Liste Leeren&quot;-Button. Wird die Liste bei Ihnen gelöscht? Code Zugehörige Beispieldatei: 07_Vue_Methods_-_Funktionen_auf_Abruf.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Challenge 1 - Lösung&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Challenge 1: Lösung&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot; v-if=&quot;item.startsWith('B')&quot;&gt;{{ item }}&lt;\/li&gt; &lt;li v-else&gt;Geheim!&lt;\/li&gt; &lt;\/ul&gt; &lt;button class=&quot;btn btn-primary&quot; @click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ] }, methods: { emptyList() { this.shoppingList = []; } } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Vue_Methods_-_Funktionen_auf_Abruf.html"},{"title":"Challenge 2 - Liste erweitern","text":"Challenge 2: Liste erweitern Aufgabe Lösungsansätze Besondere Herausforderung Challenge 2: Liste erweitern Im vergangenen Abschnitt wurde gezeigt, wie man Funktionen auf Abruf in einer VueJS-Instanz nutzen kann. Davor wurde gezeigt, wie man Inputs mit dem VueJS Datenmodell koppelt. Zugehörige Beispieldatei: 08_Challenge_2.html Aufgabe Kreieren Sie eine Möglichkeit neue Dinge zur Einkaufsliste hinzuzufügen. Folgen Sie dabei den Lösungsansätzen und orientieren Sie sich am bereits existierenden Code. Lösungsansätze Die zu bearbeitenden Stellen im Code sind mit \/\/ TODO oder &lt;!-- TODO --&gt; markiert. Schaffen eine neue data-Variable mit dem Namen newItem. Der Wert sollte leer sein (''). Vergessen Sie nicht Kommata zu setzen. Erstellen Sie im Methods-Bereich eine neue Funktion addItem(). Wenn diese ausgeführt wird, soll der aktuelle Wert von newItem in die shoppingList hinzugefügt werden. Nutzen Sie dazu die push()-Funktion für Listen (Beispiel siehe unten). Setzen Sie this richtig ein. Erstellen Sie im HTML-Bereich einen neuen Text-Input und binden Sie ihn über die v-model-Direktive an die entsprechende Variable. Erstellen Sie einen Neuen Button mit der Aufschrift &quot;Hinzufügen&quot;. Wenn der Button geklickt wird, soll die Funktion addItem ausgeführt werden. let listOfAnimals = ['Hund', 'Katze', 'Maus']; const panda = 'Panda'; listOfAnimals.push(panda); \/\/ ['Hund', 'Katze', 'Maus', 'Panda']; Besondere Herausforderung Wenn der &quot;Hinzufügen&quot;-Button geklickt wird, soll der newItem-Wert wieder geleert werden. Stellen Sie sicher, dass keine doppelten Einträge in die Einkaufsliste aufgenommen werden. Stellen Sie sicher, dass keine leeren Einträge in die Einkaufsliste aufgenommen werden.","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_2_-_Liste_erweitern.html"},{"title":"Challenge 2 - Lösung","text":"Challenge 2: Lösung JavaScript HTML Code Challenge 2: Lösung Hier ist unsere Musterlösung zur Challenge 2: Liste erweitern. JavaScript Im data-Bereich wurde eine neue Variable newItem vergeben. Im methods-Bereich wurde eine neue Funktion addItem() angelegt. Diese wird näher erläutert. if (this.newItem.length) - Wenn die Zeichenkette vom neuen Eintrag größer als 0 ist. if (!this.shoppingList.includes(this.newItem)) - Wenn der Eintrag noch nicht in der Einkaufsliste existiert. this.shoppingList.push(this.newItem) - Füge den neuen Eintrag der Einkaufsliste hinzu. this.newItem = '' - Setze die Eingabe auf einen leeren String zurück. addItem() { if (this.newItem.length &amp;&amp; !this.shoppingList.includes(this.newItem)) { this.shoppingList.push(this.newItem); this.newItem = ''; } Insgesamt könnte der JavaScript-Teil Ihrer Vue-Instanz folgendermaßen aussehen. const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ], \/\/ TODO - Hier neue Variable anlegen newItem: '', }, methods: { emptyList() { this.shoppingList = []; }, \/\/ TODO - Hier neue Funktion anlegen addItem() { if (this.newItem.length &amp;&amp; !this.shoppingList.includes(this.newItem)) { this.shoppingList.push(this.newItem); this.newItem = ''; } } } }); HTML Folgende Elemente wurden hinzugefügt: &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; - Neues Text-Formular-Feld, welches via v-model an die newItem-Variable gebunden wurde. &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot;&gt;Hinzufügen&lt;\/button&gt; - Neuer Button. Wenn er geklickt wird, wird die Funktion addItem() ausgeführt (s.o.). &lt;div&gt; &lt;label&gt;Neuer Wunsch:&lt;\/label&gt; &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot;&gt;Hinzufügen&lt;\/button&gt; &lt;\/div&gt; Code Zugehörige Beispieldatei: 09_Challenge_2_-_Solution.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Challenge 1 - Lösung&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Challenge 2: Lösung&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; &lt;\/ul&gt; &lt;button class=&quot;btn btn-primary&quot; @click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; &lt;!-- TODO: Hier neuen Input und Button anlegen--&gt; &lt;div&gt; &lt;label&gt;Neuer Wunsch:&lt;\/label&gt; &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot;&gt;Hinzufügen&lt;\/button&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ], \/\/ TODO - Hier neue Variable anlegen newItem: '', }, methods: { emptyList() { this.shoppingList = []; }, \/\/ TODO - Hier neue Funktion anlegen addItem() { if (this.newItem.length &amp;&amp; !this.shoppingList.includes(this.newItem)) { this.shoppingList.push(this.newItem); this.newItem = ''; } } } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_2_-_Lösung.html"},{"title":"Computed Properties - Immer auf dem aktuellsten Stand","text":"Computed Properties - Immer auf dem aktuellsten Stand Eingaben validieren computed-Bereich Variablen an Attribute binden Code Computed Properties - Immer auf dem aktuellsten Stand Im Abschnitt zuvor wurde gezeigt, wie Funktionen auf Abruf, z.B. bei einem Button-Klick, aufgerufen werden können. Es gibt auch Computed Properties, also live-berechnete Werteigenschaften. Diese kann man als Variablen verstehen, sich im Template-Bereich wie ein Wert verhalten, im JavaScript-Bereich jedoch wie eine Funktion funktionieren. Kernfunktion: Ändert sich der Wert eines Werts, der in der computed-Funktion referenziert ist, wird diese Funktion neu ausgeführt und ein neuer Wert berechnet. Eingaben validieren In der Challenge 2 sollten Eingabemöglichkeiten für neue Einkaufslisteneinträge geschaffen werden. Wenn die Eingabe jedoch noch leer ist, oder der Einkaufswunsch bereits auf der Liste steht, soll man den Button nicht drücken können. Weiterhin sollte angezeigt werden computed-Bereich Wir erweitern unsere VueJS-Instanz um den computed-Bereich. Dieser ähnelt im Aufbau dem methods-Bereich. Dabei legen wir eine computed-property-Funktion isValidNewItem(), welches überprüfen soll, ob der neuer Eintrag leer oder bereits vorhanden ist. const vue = new Vue({ el: '#root', data: { \/\/ ... }, methods: { \/\/ ... }, computed: { isValidNewItem() { if (this.shoppingList.includes(this.newItem) || this.newItem.length === 0) { return false; } return true; }, } }); Szenario 1: Einkaufsliste: [Brot, Bananen, Schokolade] Neuer Eintrag: (leer) isValidNewItem: false Szenario 2: Einkaufsliste: [Brot, Bananen, Schokolade] Neuer Eintrag: Brot isValidNewItem: false Szenario 3: Einkaufsliste: [Brot, Bananen, Schokolade] Neuer Eintrag: Bier isValidNewItem: true Nun kann isValidNewItem wie eine data-Variable im HTML-Bereich genutzt werden. Variablen an Attribute binden Man kann einen Button deaktivieren, wenn man ihm das disabled-Attribut verleiht. &lt;button disabled&gt;Hinzufügen&lt;\/button&gt; Das disabled-Attribut soll jedoch nur dann aktiviert sein, wenn isValidNewItem nicht true ist. Mit ! können true und false Werte umgekehrt werden, also !isValidNewItem. Mit der v-bind-Direktive kann der Status von isValidNewItem an das disabled-Attribut gebunden werden &lt;button v-bind:disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt; Dieser Ausdruck kann auch verkürzt werden: &lt;button :disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt; Code Zugehörige Beispieldatei: 10_Computed_Properties_-_Immer_auf_dem_aktuellsten_Stand.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Challenge 1 - Lösung&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Challenge 2: Lösung&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste lautet: &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; &lt;\/ul&gt; &lt;button class=&quot;btn btn-primary&quot; @click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; &lt;!-- TODO: Hier neuen Input und Button anlegen--&gt; &lt;div&gt; &lt;label&gt;Neuer Wunsch:&lt;\/label&gt; &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot; v-bind:disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ], \/\/ TODO - Hier neue Variable anlegen newItem: '', }, methods: { emptyList() { this.shoppingList = []; }, \/\/ TODO - Hier neue Funktion anlegen addItem() { if (this.newItem.length &amp;&amp; !this.shoppingList.includes(this.newItem)) { this.shoppingList.push(this.newItem); this.newItem = ''; } } }, computed: { isValidNewItem() { if (this.shoppingList.includes(this.newItem)) { return false; } if (this.newItem.length) { return true; } return false; }, } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Computed_Properties_-_Immer_auf_dem_aktuellsten_Stand.html"},{"title":"Challenge 3 - Mehr Infos mit Computed Properties","text":"Challenge 3: Mehr Infos mit Computed Properties Aufgaben Lösungsansätze Challenge 3: Mehr Infos mit Computed Properties Zugehörige Beispieldatei: 11_Challenge_3.html Aufgaben Lassen Sie eine Information mit dem Text Neuer Eintrag leer oder bereits vorhanden einblenden, wenn isValidNewItem den Status false hat. Erstellen Sie ein neues Element im HTML-Bereich, wo Sie die Anzahl der Einträge in der Einkaufsliste anzeigen. Folgen Sie dabei den Lösungsansätzen und orientieren Sie sich am bereits existierenden Code. Lösungsansätze Die zu bearbeitenden Stellen im Code sind mit \/\/ TODO oder &lt;!-- TODO --&gt; markiert. Erstellen Sie im HTML-Bereich ein neues &lt;div&gt; oder &lt;span&gt;-Element und nutzen Sie die v-if-Direktive in Verbindung mit isValidNewItem. Mit einem ! vor isValidNewItem können Sie die Werte true und false ins Gegenteil verkehren. Erstellen Sie im computed-Bereich eine neue Computed Property numberOfItems. Sie können sich die Anzahl aller Einträge in einer Liste z.B. folgendermaßen anzeigen lassen: let listOfAnimals = ['Hund', 'Katze', 'Maus']; listOfAnimals.length; \/\/ 3 Erstellen Sie im HTML-Bereich an der markierten Stelle ein neues Element und lassen dort die Anzahl der Listeneinträge anzeigen.","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_3_-_Mehr_Infos_mit_Computed_Properties.html"},{"title":"Challenge 3 - Lösung","text":"Challenge 3: Lösung JS HTML Code Challenge 3: Lösung Hier ist unsere Musterlösung zur Challenge 3: Mehr Infos mit Computed Properties. JS Im computed-Bereich wurde eine neue Computed Property numberOfItems angelegt. computed: { isValidNewItem() { if (this.shoppingList.includes(this.newItem) || this.newItem.length === 0) { return false; } return true; }, \/\/ TODO - hier neue Computed Property anlegen numberOfItems() { return this.shoppingList.length; } } HTML Die Anzahl der Einkaufslisteneinträge wird hier gezeigt: Meine Einkaufsliste &lt;span&gt;({{ numberOfItems }}) &lt;\/span&gt;lautet: Die Zusatzinformation, ob ein neuer Eintrag noch leer oder bereits in der Einkaufsvorhanden ist, wurde folgendermaßen gelöst. Es folgt dem gleichen Schema wie der Button-Deaktivierung aus dem Abschnitt zu Computed Properties. &lt;div&gt; &lt;label&gt;Neuer Wunsch:&lt;\/label&gt; &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot; v-bind:disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt; &lt;\/div&gt; &lt;!-- TODO - Hier Info anzeigen, wenn die Eingabe nicht gültig ist--&gt; &lt;div v-if=&quot;!isValidNewItem&quot;&gt; Neuer Eintrag leer oder bereits vorhanden &lt;\/div&gt; Code Zugehörige Beispieldatei: 12_Challenge_3_-_Solution.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: Challenge 1 - Lösung&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;Challenge 2: Lösung&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;root&quot;&gt; &lt;label&gt;Namen eingeben:&lt;\/label&gt;&lt;input type=&quot;text&quot; v-model=&quot;name&quot;&gt; &lt;div&gt;Mein Name ist: {{ name }}&lt;\/div&gt; &lt;div&gt; Meine Einkaufsliste &lt;span&gt;({{ numberOfItems }}) &lt;\/span&gt;lautet: &lt;!-- TODO - Hier die Anzahl der Listeneinträge anzeigen lassen --&gt; &lt;ul&gt; &lt;li v-for=&quot;item in shoppingList&quot;&gt;{{ item }}&lt;\/li&gt; &lt;\/ul&gt; &lt;button class=&quot;btn btn-primary&quot; @click=&quot;emptyList&quot;&gt;Liste leeren&lt;\/button&gt; &lt;div&gt; &lt;label&gt;Neuer Wunsch:&lt;\/label&gt; &lt;input type=&quot;text&quot; v-model=&quot;newItem&quot;&gt; &lt;button class=&quot;btn btn-info&quot; @click=&quot;addItem&quot; v-bind:disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt; &lt;\/div&gt; &lt;!-- TODO - Hier Info anzeigen, wenn die Eingabe nicht gültig ist--&gt; &lt;div v-if=&quot;!isValidNewItem&quot;&gt; Neuer Eintrag leer oder bereits vorhanden &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#root', data: { name: 'Alexander von Humboldt', shoppingList: [ 'Bananen', 'Brot', 'Schokolade' ], newItem: '', }, methods: { emptyList() { this.shoppingList = []; }, addItem() { if (this.newItem.length &amp;&amp; !this.shoppingList.includes(this.newItem)) { this.shoppingList.push(this.newItem); this.newItem = ''; } } }, computed: { isValidNewItem() { if (this.shoppingList.includes(this.newItem) || this.newItem.length === 0) { return false; } return true; }, \/\/ TODO - hier neue Computed Property anlegen numberOfItems() { return this.shoppingList.length; } } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"Erste_Schritte_mit_VueJS\/Challenge_3_-_Lösung.html"},{"title":"Zusammenfassung","text":"Zusammenfassung Zusammenfassung In diesem Kapitel wurde gezeigt, wie man VueJS in ein HTML-Dokument einbindet, Daten und Templates in einer VueJS-Instanz verwaltet, Templates mit if-Konditionen und Formulareingaben nutzt, VueJS-Instanz-interne Funktionen und mit On-Click-Events interaktiv gestaltet, sowie sog. Computed Properties, d.h. sich stetig aktualisierende Variablen, anwendet. Es gab drei Challenges, um das erlernte Wissen anzuwenden: Challenge 1: Anzeige mit Bedingungen Challenge 2: Liste erweitern Challenge 1: Mehr Infos mit Computed Properties Im folgenden Kapitel werden die Inhalte der ersten beiden Kapitel dann zusammengeführt. Die Daten aus der eXist-db werden nach JSON serialisiert und im Front-End über VueJS anzeigbar gemacht.","tags":"","url":"Erste_Schritte_mit_VueJS\/Zusammenfassung.html"},{"title":"Übersicht","text":"Übersicht Übersicht In diesem Abschnitt werden Sie lernen, wie man die Datenstruktur von quoteSalute in VueJS nutzbar macht, VueJS an eine eXist-db mit vue-resource anbindet, Filtermöglichkeiten und Parameterübergaben implementiert. Es gibt drei Challenges: Challenge 1: Datenstrukturen und Templates anlegen Challenge 2: Neue Grußformel zum Start Challenge 3: Neue Grußformel auf Knopfdruck","tags":"","url":"eXist-db_und_VueJS\/Übersicht.html"},{"title":"Technisches Setup","text":"Technisches Setup Beispieldateien Software Firefox Google Chrome Technisches Setup Beispieldateien Wir haben Code-Skelette zum Nachvollziehen vorbereitet. Laden Sie folgende Datei herunter und entpacken Sie das ZIP-Archiv auf Ihrem Rechner. Alle Beispiele in diesem Kapitel beziehen sich auf Dateien aus diesem Archiv. quoteSalute-examples.zip Die Abhängigkeiten aus den Code-Beispielen werden mitgeliefert. Sämtlicher JavaScript-Code wird in einem &lt;script&gt;-Block am Ende des &lt;body&gt;-Tags verwaltet, sodass HTML und JavaScript für dieses Tutorial eine geschlossene Einheit bilden. Software Ein moderner Browser, z.B. Mozilla Firefox oder Google Chrome (nicht Internet Explorer!) Ggf. eine Browser-Erweiterung zur Nutzung von CORS-Daten (siehe unten), falls Sie die REST-API von quoteSalute nutzen möchten. Ein Code-Editor, z.B. Visual Studio Code, Atom oder Notepad++ Firefox Mit Firefox sollte alles problemlos funktionieren. Optional: Vue.js devtools CORS Everywhere Google Chrome Sollten Sie Google Chrome (oder Chromium) verwenden, installieren Sie bitte folgende Erweiterungen: Web Server for Chrome Wenn Sie JavaScript in HTML-Dateien benutzen möchten, die auf Ihrer lokalen Festplatte liegen, blockiert Chrome aus Sicherheitsgründen dessen ausführung. Mit dieser Erweiterung schaffen Sie lokal einen &quot;Mini-Server&quot; für ausgewählte Dateien, um JavaScript lokal im Browser auszuführen. Optional: Allow CORS Vue.js devtools","tags":"","url":"eXist-db_und_VueJS\/Technisches_Setup.html"},{"title":"quoteSalute Datenstruktur","text":"quoteSalute Datenstruktur XML-Daten Ergebnisse im Browser Lokale eXist-db Instanz quoteSalute (live) JSON-Daten quoteSalute Datenstruktur Dieser Abschnitt wiederholt einige Schritte und Inhalte, die Bereits im Kapitel zur Nutzung von eXist-db behandelt wurden. XML-Daten Eine Grußformel im quoteSalute ist in der eXist-db folgendermaßen hinterlegt: &lt;cit&gt; &lt;quote&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/quote&gt; &lt;edition&gt;Jean Paul – Sämtliche Briefe digital&lt;\/edition&gt; &lt;title&gt;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&lt;\/title&gt; &lt;url&gt;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&lt;\/url&gt; &lt;language&gt;deu&lt;\/language&gt; &lt;licence&gt;&lt;\/licence&gt; &lt;\/cit&gt; Ergebnisse im Browser Sie können sich ein zufälliges Zitat aus der eXist-db App von quoteSalute direkt über ihren Browser im Rohformat anzeigen lassen. Lokale eXist-db Instanz Eigene Datei abfrage-challenge-02.xql - http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage-challenge-02.xql Vorgefertigte Datei abfrage.xql - http:\/\/localhost:8080\/exist\/apps\/quotesalute\/abfrage.xql quoteSalute (live) Von quoteSalute bereitgestellte Schnittstelle - https:\/\/correspsearch.net\/quotesalute\/abfrage.xql JSON-Daten Das Ergebnis wird letztendlich von der eXist-db App zu JSON serialisiert und zurückgeliefert. { &quot;quote&quot;:&quot;Mit Verehrung Ihr ergebenster etc.&quot;, &quot;edition&quot;:&quot;Jean Paul – Sämtliche Briefe digital&quot;, &quot;title&quot;:&quot;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&quot;, &quot;url&quot;:&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot;, &quot;language&quot;:&quot;deu&quot;, &quot;licence&quot;:null } Diese Grußformel wird fortan als Startbeispiel genutzt.","tags":"","url":"eXist-db_und_VueJS\/quoteSalute_Datenstruktur.html"},{"title":"quoteSalute Basisvorlage","text":"quoteSalute Basisvorlage JavaScript HTML Code quoteSalute Basisvorlage In diesem Abschnitt wird der Grundaufbau der quoteSalute VueJS-App vorgestellt. Zugehörige Beispieldatei: 03_quoteSalute_Basisvorlage.html JavaScript Im JavaScript-Abschnitt wurde eine neue VueJS-Instanz initialisiert. Diese greift auf den Bereich im HTML-Code mit der ID #quoteSalute zu. &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#quoteSalute', data: { \/\/ data noch leer } }); &lt;\/script&gt; HTML Das Grußformelbeispiel aus dem vorigen Abschnitt wird vorerst hart in den HTML-Code eingetragen. Vergleichen Sie es mit dem XML- und JSON-Code aus dem vorigen Abschnitt. &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;Jean Paul – Sämtliche Briefe digital&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/em&gt;&lt;\/p&gt; &lt;a href=&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;\/div&gt; &lt;\/div&gt; Code Zugehörige Beispieldatei: 03_quoteSalute_Basisvorlage.html &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: quoteSalute&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;quoteSalute&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;quoteSalute&quot;&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;Jean Paul – Sämtliche Briefe digital&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;Mit Verehrung Ihr ergebenster etc.&lt;\/em&gt;&lt;\/p&gt; &lt;a href=&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#quoteSalute', data: { \/\/ data noch leer } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"eXist-db_und_VueJS\/quoteSalute_Basisvorlage.html"},{"title":"Challenge 1 - Datenstruktur und Templates anlegen","text":"Challenge 1: Datenstruktur und Templates anlegen Aufgabe Lösungsansätze Challenge 1: Datenstruktur und Templates anlegen Im vorherigen Kapitel haben Sie gelernt, wie man Variablen mit VueJS verwaltet und anzeigt. Zugehörige Beispieldatei: 04_Challenge_1_-_Datenstruktur_und_Templates_anlegen.html Aufgabe Erstellen Sie das Datenmodell der Vue-Instanz und lassen Sie die Daten im HTML-Code an den passenden Stellen anzeigen. Nehmen Sie zuerst folgende JSON-Grußformel als Orientierungspunkt. { &quot;quote&quot;:&quot;Mit Verehrung Ihr ergebenster etc.&quot;, &quot;edition&quot;:&quot;Jean Paul – Sämtliche Briefe digital&quot;, &quot;title&quot;:&quot;An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.&quot;, &quot;url&quot;:&quot;https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612&quot;, &quot;language&quot;:&quot;deu&quot;, &quot;licence&quot;:null } Lösungsansätze Öffnen Sie die Datei 04_Challenge_1.html sowohl mit einem Editor und Browser. Wenn das Ergebnis im Browser wie vor den Änderungen aussieht, scheint Ihre Lösung richtig zu sein. Die zu bearbeitenden Stellen im Code sind mit \/\/ TODO oder &lt;!-- TODO --&gt; markiert. Erstellen Sie für jedes Element in der JSON-Grußformelvorlage eine neue data-Variable. Benutzen Sie den Namen der Elements auch als Name für die Variablen Übertragen Sie Werte für die Elemente per Hand in die Variable. Ersetzen Sie die hartgecodeten Informationen zur Grußformel im HTML-Bereich mit VueJS-Templates {{ }} an den passenden Stellen. Auch HTML-Attribute können VueJS-Variablen zugewiesen werden. Denken Sie dabei an ein Beispiel aus einer vergangenen Challenge zurück: &lt;button v-bind:disabled=&quot;!isValidNewItem&quot;&gt;Hinzufügen&lt;\/button&gt;","tags":"","url":"eXist-db_und_VueJS\/Challenge_1_-_Datenstruktur_und_Templates_anlegen.html"},{"title":"Challenge 1 - Lösung","text":"Challenge 1: Lösung JavaScript HTML Code Challenge 1: Lösung Hier ist unsere Musterlösung zur Challenge 1: Datenstruktur und Templates anlegen. JavaScript Die JSON-Grußformel aus dem vorigen Abschnitt wurde in VueJS-Variablen übersetzt. Nun sind diese Variablen nachnutzbar. const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null } }); HTML Die hartgecodeten Zeichenketten wurden durch die entsprechenden Variablen ersetzt. Statt der Grußformel &quot;Mit Verehrung Ihr ergebenster etc.&quot; wird nun auf die entsprechende Variable {{ quote }} zurückgegriffen. Um die url-Variable ans href-Attribut anzubinden, wurde die v-bind-Direktive, bzw. dessen Kurzform genutzt. &lt;a v-bind:href=&quot;url&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;div id=&quot;quoteSalute&quot;&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;{{ edition }}&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;{{ title }}&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;{{ quote }}&lt;\/em&gt;&lt;\/p&gt; &lt;a :href=&quot;url&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; Code &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: quoteSalute&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;quoteSalute&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;quoteSalute&quot;&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;{{ edition }}&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;{{ title }}&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;{{ quote }}&lt;\/em&gt;&lt;\/p&gt; &lt;a :href=&quot;url&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"eXist-db_und_VueJS\/Challenge_1_-_Lösung.html"},{"title":"Aktionen beim Start","text":"Aktionen beim Start Eine neue Grußformel created Aktionen beim Start In diesem Abschnitt wird vorgestellt, wie bestimmte VueJS-Operationen bereits beim Start der Instanz ausgeführt werden. Zugehörige Beispieldatei: 06_Aktionen_beim_Start.html Eine neue Grußformel Öffnen Sie die Beispieldatei 06_Aktionen_beim_Start.html. Warum wird eine neue Grußformel angezeigt? created Neben data, methods und computed gibt es noch weitere Möglichkeiten eine VueJS-Instanz auszugestalten. Legt man eine created() Funktion an, wird der Inhalt dieser Funktion ausgeführt, sobald die VueJS-Instanz vom Browser geladen wurde. Das untenstehende Beispiel läuft wie folgt ab: Lade das data-Element. Der Wert von quote ist &quot;Mit Verehrung Ihr ergebenster etc.&quot;. Prüfe, ob es eine created()-Funktion gibt. Ja, also führe Sie aus. In der created()-Funktion wird der Wert von quote mit &quot;Eine neue Grußformel&quot;. Jetzt ist die VueJS-Instanz bereit zum Rendern. Wie wird die Grußformel lauten, die angezeigt wird? const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null }, methods: { \/\/ ... }, computed: { \/\/ ... }, created() { this.quote = 'Eine neue Grußformel' } });","tags":"","url":"eXist-db_und_VueJS\/Aktionen_beim_Start.html"},{"title":"VueJS an eXist-db anbinden","text":"VueJS an eXist-db anbinden vue-resource VueJS an eXist-db anbinden In diesem Abschnitt wird gezeigt, wie man mit vue-resource in einer VueJS-Instanz Daten asynchron von einer eXist-db-Instanz abruft und verarbeitet. Zugehörige Beispieldatei: 03_quoteSalute_Basisvorlage.html vue-resource Die Funktionalität von VueJS wird durch eine Zusatzbibliothek ab diesem Abschnitt erweitert. Nachdem VueJS importiert wird, importieren wir anschließend vue-resource. &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script src=&quot;js\/vue-resource.js&quot;&gt;&lt;\/script&gt; vue-resource erlaubt es uns, asynchrone Anfragen (sog. AJAX-Requests) an einen Server zu senden. Während Sie also bereits mit dem Browser eine Webseite geöffnet haben, werden im Hintergrund zusätzliche Informationen vom selben oder anderen Servern geladen, um die Webseite mit neuen Informationen zu füttern. Wir benutzen vue-resource um neue Grußformeln von unserem quoteSalute-Back-End zu holen und in unserer VueJS-Instanz nutzbar zu machen.","tags":"","url":"eXist-db_und_VueJS\/VueJS_an_eXist-db_anbinden.html"},{"title":"Challenge 2 - Neue Grußformel zum Start","text":"Challenge 2: Neue Grußformel zum Start Aufgabe Lösungsansätze Challenge 2: Neue Grußformel zum Start Zugehörige Beispieldatei: 08_Challenge_2.html Im vorherigen Abschnitt wurde die VueJS-Instanz um vue-resource erweitert, sodass man innerhalb einer VueJS-Instanz sog. AJAX-Requests ausführen kann. In der created()-Methode wurde bereits ein Skelett angelegt, um von der quoteSalute-API eine neue Grußformel abzurufen. Aufgabe Erweitern Sie die created()-Funktion bzw. den AJAX-Request mit vue-resource so, dass sämtliche Informationen zu einer Grußformel in den data-Variablen gespeichert werden. Lösungsansätze Öffnen Sie die Datei 08_Challenge_8.html sowohl mit einem Editor und Browser. Wenn das Ergebnis bei jedem Neuladen des Browsertabs anders aussieht, scheint Ihr Ergebnis richtig zu sein. Die zu bearbeitenden Stellen im Code sind mit \/\/ TODO markiert. Orientieren Sie sich an der JSON-Datenstruktur. Tipp: Nutzen Sie die Entwicklerwerkzeuge Ihres Browsers. Drücken Sie F12. Gehen Sie auf den Tab Netzwerkanalyse. Klicken Sie auf XHR. Laden Sie die Seite neu. Es sollte ein Eintrag erscheinen. Klicken Sie auf diesen. Klicken Sie auf Antwort. Das Ergebnis des asynchronen Requests wird Ihnen dort angezeigt.","tags":"","url":"eXist-db_und_VueJS\/Challenge_2_-_Neue_Grußformel_zum_Start.html"},{"title":"Challenge 2 - Lösung","text":"Challenge 2: Lösung JavaScript Challenge 2: Lösung Hier ist unsere Musterlösung zur Challenge 2: Neue Grußformel zum Start. Zugehörige Beispieldatei: 09_Challenge_2_Solution.html Bei jedem Neuladen der Seite wird eine neue Grußformel geholt. JavaScript Für jede Variable im data-Objekt wurde der Prozess des Überschreibens der Werte analog wiederholt. created() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql').then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); }","tags":"","url":"eXist-db_und_VueJS\/Challenge_2_-_Lösung.html"},{"title":"Challenge 3 - Neue Grußformel auf Knopfdruck","text":"Challenge 2: Neue Grußformel auf Knopfdruck Aufgabe Vorgehensweise Bonusaufgabe Challenge 2: Neue Grußformel auf Knopfdruck Zugehörige Beispieldatei: 10_Challenge_3.html Aufgabe Statt immer die Seite neu Laden zu müssen, soll eine neue Grußformel auf Knopfdruck geholt werden. Vorgehensweise Öffnen Sie die Datei 08_Challenge_8.html sowohl mit einem Editor und Browser. Wenn das Ergebnis bei jedem Druck auf den neuen Knopf anders aussieht, scheint Ihr Ergebnis richtig zu sein. Die zu bearbeitenden Stellen im Code sind mit \/\/ TODO und ` markiert. Legen Sie den methods-Bereich der VueJS-Instanz an Erstellen Sie eine Funktion fetchSalute() und nutzen Sie den Code aus der created()-Methode nach. Erstellen Sie im HTML-Bereich an der markierten Stelle einen Button mit der Aufschrit Neu und verbinden Sie ihn mit der fetchSalute()-Funktion über v-on:click. Bonusaufgabe Verkürzen Sie den Inhalt der created()-Methode. Brauch man den Code wirklich zwei Mal?","tags":"","url":"eXist-db_und_VueJS\/Challenge_3_-_Neue_Grußformel_auf_Knopfdruck.html"},{"title":"Challenge 3 - Lösung","text":"Challenge 3: Lösung JavaScript HTML Code Challenge 3: Lösung Hier ist unsere Musterlösung zur Challenge 3: Neue Grußformel auf Knopfdruck. Zugehörige Beispieldatei: 11_Challenge_3_Solution.html. Bei Druck auf den Neu-Button wird eine neue Grußformel geholt. JavaScript Der Code zum Abrufen einer neuen Grußformel wurde in die Methode fetchSalute() umgelagert. In der created()-Methode wird fetchSalute() einfach aufgerufen. const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null }, methods: { fetchSalute() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql').then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); } }, created() { this.fetchSalute(); } }); HTML Es wurde ein neuer Button eingerichtet. Die fetchSalute()-Methode wird ausgeführt, wenn er geklickt wird (v-on:click). &lt;button class=&quot;btn btn-primary&quot; v-on:click=&quot;fetchSalute&quot;&gt;Neu&lt;\/button&gt; Code &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: quoteSalute&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;quoteSalute&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;quoteSalute&quot;&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;{{ edition }}&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;{{ title }}&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;{{ quote }}&lt;\/em&gt;&lt;\/p&gt; &lt;a :href=&quot;url&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;div&gt; &lt;button class=&quot;btn btn-primary&quot; v-on:click=&quot;fetchSalute&quot;&gt;Neu&lt;\/button&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script src=&quot;js\/vue-resource.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null }, methods: { fetchSalute() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql').then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); } }, created() { this.fetchSalute(); } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"eXist-db_und_VueJS\/Challenge_3_-_Lösung.html"},{"title":"Bonus - Grußformeln filtern","text":"Grußformeln filtern Datenmodell erweitern Check-Boxen einrichten Anfrage anpassen mit computed Parameters Code Grußformeln filtern In diesem Abschnitt wird gezeigt, wie Filter auf die Grußformel-Abfrage angewendet werden können. Zugehörige Beispieldatei: 12_Challenge_3_-_Solution.html. Datenmodell erweitern In diesem Beispiel wird ein Filter zum Auswählen der Sprache der Grußformel eingerichtet. Zuerst erweitern wir das Datenmodell data der VueJS-Instanz mit filterLanguage. const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null, \/\/ Siehe hier filterLanguage: [] }, created() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql').then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); } }); Check-Boxen einrichten Es werden Check-Box-Inputs eingerichtet, für die Sprachen Deutsch, Englisch und Italienisch. Mit v-model=&quot;filterLanguage&quot;. Mit dem value-Attribut fügen wir einen Wert hinzu. Wird eine Check-Box angeklickt, wird der dazugehörige Wert in das filterLanguage-Array geschrieben. Keine Haken: [] nur Deutsch: ['deu'] Deutsch und Englisch: ['deu', 'eng'] usw. &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;Sprache&lt;\/h5&gt; &lt;div class=&quot;row&quot;&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageDeu&quot; value=&quot;deu&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-female&quot;&gt;Deutsch&lt;\/label&gt; &lt;\/div&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageEng&quot; value=&quot;eng&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-male&quot;&gt;Englisch&lt;\/label&gt; &lt;\/div&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageIta&quot; value=&quot;ita&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-neutral&quot;&gt;Italienisch&lt;\/label&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; Anfrage anpassen mit computed Parameters Im Anfangskapitel zu eXist-db wurde das Filter-Prinzip von quoteSalute im Back-End bereits erklärt. Bevor die VueJs-Instanz initialisiert wird, legen wir noch eine Liste mit allen verfügbaren Sprachen an. const allLanguages = ['deu','eng','spa','fra','ita', 'grc', 'lat']; Das Back-End zerlegt mehrere Angaben zu einer Filterkategorie, indem die Werte durch X getrennt sind. Der folgende computed-Wert languageParams verbindetet alle möglichen Spracheinträge mit einem X, wenn kein Sprachfilter gesetzt wurde. Wurde jedoch eine oder mehrere Sprachen ausgewählt, verbindet er nur die ausgewählten. computed: { languageParams() { if (this.filterLanguage.length) { return this.filterLanguage.join('X') } return allLanguages.join('X'); } } In der fetchSalute()-Methode teilen wir vue-http mit, dass URL-Parameter übergeben werden sollen. vue-http passt die Anzufragende URL dann automatisch an. Sind keine Filter gesetzt, wird die dann folgende URL abgefragt: https:\/\/correspsearch.net\/quotesalute\/abfrage.xql?language=deuXengXspaXfraXitaXgrcXlat Ist z.B. nur Deutsch ausgewählt, wird folgende URL abgefragt: https:\/\/correspsearch.net\/quotesalute\/abfrage.xql?language=deu methods: { fetchSalute() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql', { params: { language: this.languageParams } }).then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); } }, Code &lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1, shrink-to-fit=no&quot;&gt; &lt;link rel=&quot;stylesheet&quot; href=&quot;css\/bootstrap.min.css&quot;&gt; &lt;title&gt;DHd19: quoteSalute&lt;\/title&gt; &lt;\/head&gt; &lt;body&gt; &lt;header class=&quot;navbar navbar-expand-lg navbar-light bg-light&quot; style=&quot;margin-bottom:20px&quot;&gt;quoteSalute&lt;\/header&gt; &lt;div class=&quot;container&quot;&gt; &lt;div id=&quot;quoteSalute&quot;&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;{{ edition }}&lt;\/h5&gt; &lt;h6 class=&quot;card-subtitle mb-2 text-muted&quot;&gt;{{ title }}&lt;\/h6&gt; &lt;p class=&quot;card-text&quot;&gt;&lt;em&gt;{{ quote }}&lt;\/em&gt;&lt;\/p&gt; &lt;a :href=&quot;url&quot; class=&quot;card-link&quot; target=&quot;_blank&quot;&gt;Zum Originalbrief&lt;\/a&gt; &lt;div&gt; &lt;button class=&quot;btn btn-primary&quot; v-on:click=&quot;fetchSalute&quot;&gt;Neu&lt;\/button&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;div class=&quot;card&quot;&gt; &lt;div class=&quot;card-body&quot;&gt; &lt;h5 class=&quot;card-title&quot;&gt;Sprache&lt;\/h5&gt; &lt;div class=&quot;row&quot;&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageDeu&quot; value=&quot;deu&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-female&quot;&gt;Deutsch&lt;\/label&gt; &lt;\/div&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageEng&quot; value=&quot;eng&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-male&quot;&gt;Englisch&lt;\/label&gt; &lt;\/div&gt; &lt;div class=&quot;form-check&quot;&gt; &lt;input type=&quot;checkbox&quot; class=&quot;form-check-input&quot; id=&quot;languageIta&quot; value=&quot;ita&quot; v-model=&quot;filterLanguage&quot;&gt; &lt;label class=&quot;form-check-label&quot; for=&quot;sender-neutral&quot;&gt;Italienisch&lt;\/label&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;\/div&gt; &lt;script src=&quot;js\/vue.js&quot;&gt;&lt;\/script&gt; &lt;script src=&quot;js\/vue-resource.js&quot;&gt;&lt;\/script&gt; &lt;script&gt; const allLanguages = ['deu','eng','spa','fra','ita', 'grc', 'lat']; const vue = new Vue({ el: '#quoteSalute', data: { quote: 'Mit Verehrung Ihr ergebenster etc.', edition: 'Jean Paul – Sämtliche Briefe digital', title: 'An Friederike Christiane Elisabeth von Ompteda. Bayreuth, 24. Dezember 1819.', url: 'https:\/\/jeanpaul-edition.de\/brief.html?num=VII_612', language: 'deu', license: null, filterLanguage: [] }, computed: { languageParams() { if (this.filterLanguage.length) { return this.filterLanguage.join('X') } return allLanguages.join('X'); } }, methods: { fetchSalute() { this.$http.get('https:\/\/correspsearch.net\/quotesalute\/abfrage.xql', { params: { language: this.languageParams } }).then(response =&gt; { this.quote = response.data.quote; this.edition = response.data.edition; this.title = response.data.title; this.url = response.data.url; this.license = response.data.license }); } }, created() { this.fetchSalute(); } }); &lt;\/script&gt; &lt;\/body&gt; &lt;\/html&gt;","tags":"","url":"eXist-db_und_VueJS\/Bonus_-_Grußformeln_filtern.html"},{"title":"Zusammenfassung","text":"Übersicht Übersicht In diesem Abschnitt haben Sie gelernt, wie man die Datenstruktur von quoteSalute in VueJS nutzbar macht, VueJS an eine eXist-db mit vue-resource anbindet, Filtermöglichkeiten und Parameterübergaben implementiert. Es gab drei Challenges: Challenge 1: Datenstrukturen und Templates anlegen Challenge 2: Neue Grußformel zum Start Challenge 3: Neue Grußformel auf Knopfdruck","tags":"","url":"eXist-db_und_VueJS\/Zusammenfassung.html"}]}