{"pages":[{"title":"eXist-db und VueJS für dynamische UI-Komponenten","text":"DHD Workshop 2019 DHD Workshop 2019","tags":"","url":"index.html"},{"title":"Bevor es losgeht","text":"Bevor es losgeht Ein kleiner Hinweis Voraussetzungen Bevor es losgeht Ein kleiner Hinweis Diese Dokumentation dient als Orientierung für den Workshop eXist-db und VueJS für dynamische UI-Komponenten auf der DHd-Konferenz 2019 in Mainz\/Frankfurt am Main. Während des Workshops stellen wir die nötige Infrastruktur zum Mitmachen bereit. Danach können die Inhalte weiterhin nachvollzogen werden, indem man sich die nötigen Tools selbst auf dem eigenen Rechner installiert. Bis 05.04. - Infrastruktur nachnutzen Ab 05.04. - Tools selbst installieren Dieser Leitfaden ist darauf ausgerichtet, dass die Inhalte selbst vollzogen werden können. Voraussetzungen Folgende Kenntnisse werden vorausgesetzt: Grundlegende Kenntnisse in HTML, XML und JavaScript Folgende Software sollte installiert sein: Ein moderner Browser, z.B. Mozilla Firefox oder Google Chrome (nicht Internet Explorer!) Ein Code-Editor, z.B. Visual Studio Code, Atom oder Notepad++ Eine Java-Installation (siehe Systemvoraussetzungen) eXist-db (Einrichtungsanleitung) quoteSalute App in der eXist-db (Einrichtungsanleitung)","tags":"","url":"Vorab\/Bevor_es_losgeht.html"},{"title":"quoteSalute","text":"","tags":"","url":"Vorab\/quoteSalute.html"},{"title":"Der quoteSalute XML Korpus","text":"","tags":"","url":"Vorab\/Der_quoteSalute_XML_Korpus.html"},{"title":"eXist-db Installation","text":"eXist-db Installation Systemvoraussetzungen Installation eXist-db starten eXist-db Installation Um an quoteSalute arbeiten zu können, muss zunächst eXist-db und dann die quoteSalute.DB App installiert werden. In diese Anleitung sind alle notwendigen Schritte beschrieben. Systemvoraussetzungen eXist-db läuft mit Java und funktioniert somit auf allen aktuellen Linux, macOS und Windows Betriebsystemen. Folgende Voraussetzungen sind erforderlich: mindestens Java 8 (Installations-Anleitungen finden Sie hier: Java-Downloads für alle Betriebssysteme) ca. 200Mb Festplattenkapazität ca. 512Mb Arbeitsspeicher Für einige Schritte sind administrative Rechte erforderlich. Hinweis: Prüfen Sie vorab, ob Java 8 installiert ist und andere\/ältere Versionen von eXist-db vollständig deinstalliert sind. Installation Gehen Sie auf Homepage von eXist-db und klicken Sie auf &quot;Download eXist-db&quot;. Es wird eine .jar-Datei heruntergeladen mit dem Namen eXist-db-setup-[version].jar (z.B. eXist-db-setup-4.6.1.jar). Gehen Sie in den Downloadordner und führen Sie die .jar-Datei aus: bei Windows und Mac doppelt klicken bei Linux rechtsklick und dann auf &quot;mit Java ausführen&quot; klicken oder über die Kommandozeile: java -jar eXist-db-setup-[version].jar Nun öffnet sich ein Installationsassitent. Wir empfehlen die Standardeinstellungen beizubehalten. Klicken Sie auf &quot;Next&quot;. Sie werden nach folgenden Schritten gefragt: Installationsordner: wählen Sie einen Pfad und klicken Sie auf &quot;Next&quot;. Datenordner wählen Sie einen Pfad und klicken Sie auf &quot;Next&quot;. Admin Passwort und Memory Einstellungen: geben Sie hier ein Passwort Ihrer Wahl ein. Dieses wird später bei bestimmten Aktionen in eXist-db benötigt. Hinweis: das Freilassen stellt ein Sicherheitsrisiko dar und ist deshalb nicht zu empfehlen. Package Installation: Klicken Sie &quot;Next&quot; Nun erfolgt die package installation. Klicken Sie anschließend auf &quot;Next&quot; Nun erfolgen weitere Installationen. Klicken Sie anschließend auf &quot;Next&quot;. Wählen Sie Ihre präferierten Shortcuts und klicken Sie anschließend auf &quot;Next&quot; Bei erfolgreicher Installation wird dieses Fenster angezeigt: eXist-db starten Um eXist-db zu starten, führen Sie die exist.jar in ihrem Installationsordner aus. Es öffnet sich nun ein Fenster: Das eXist-db Icon findet sich nun in Ihrer Symbolleiste. Zum Öffnen des Menüs klicken Sie auf das Icon . Klicken Sie auf &quot;install as a Service&quot; falls dies nicht bereits erfolgt ist.","tags":"","url":"eXist-db_Setup\/eXist-db_Installation.html"},{"title":"quoteSalute Installation","text":"quoteSalute Installation Weitere Informationen quoteSalute Installation Gehen Sie auf das Github-Repository von quoteSalute und speichern Sie die Datei quoteSalute.db-[version].xar lokal ab. Öffnen Sie das eXist-db Menü (klick auf das Icon in der Symbolleiste) und klicken Sie auf &quot;Open Dashboard&quot;. Ihr Standardbrowser (vorzugsweise Firefox oder Chrome) sollte sich nun öffnen und das eXist-db Dashboard anzeigen . Geben Sie nun Ihre Admin-Nutzerdaten ein: User: admin Password: [Ihr Passwort, das Sie bei der Installation vergeben haben] Öffnen Sie die Package Manager App. Klicken Sie auf den Button add a package, ziehen Sie die gespeicherte Datei quoteSalute.db-〈version〉.xar in das Fenster Upload Packages oder klicken Sie auf Upload und wählen die xar-Datei über Ihr Dateiexplorer aus und schließen Sie das Fenster Package Manager. Im Dashboard sehen Sie nun die quoteSalute.DB App. Weitere Informationen Java-Downloads für alle Betriebssysteme eXist-db Basic Installation eXist-db Troubleshooting","tags":"","url":"eXist-db_Setup\/quoteSalute_Installation.html"},{"title":"Erste Schritte mit eXide","text":"Erste Schritte mit eXide Erste Schritte mit eXide TODO","tags":"","url":"XML_zu_JSON_in_eXist-db\/Erste_Schritte_mit_eXide.html"},{"title":"Den quoteSalute Korpus abfragen","text":"Den quoteSalute Korpus abfragen Den quoteSalute Korpus abfragen TODO","tags":"","url":"XML_zu_JSON_in_eXist-db\/Den_quoteSalute_Korpus_abfragen.html"},{"title":"Challenge 1 - Ein Zitat holen","text":"Challenge 1: Ein Zitat holen Challenge 1: Ein Zitat holen","tags":"","url":"XML_zu_JSON_in_eXist-db\/Challenge_1_-_Ein_Zitat_holen.html"}]}